adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event TRIGGERED[7] */
#define EGU_INTENCLR_TRIGGERED7_Pos (7UL) /*!< Position of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Msk (0x1UL << EGU_INTENCLR_TRIGGERED7_Pos) /*!< Bit mask of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED7_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED7_Clear (1UL) /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event TRIGGERED[6] */
#define EGU_INTENCLR_TRIGGERED6_Pos (6UL) /*!< Position of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Msk (0x1UL << EGU_INTENCLR_TRIGGERED6_Pos) /*!< Bit mask of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED6_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED6_Clear (1UL) /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event TRIGGERED[5] */
#define EGU_INTENCLR_TRIGGERED5_Pos (5UL) /*!< Position of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Msk (0x1UL << EGU_INTENCLR_TRIGGERED5_Pos) /*!< Bit mask of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED5_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED5_Clear (1UL) /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event TRIGGERED[4] */
#define EGU_INTENCLR_TRIGGERED4_Pos (4UL) /*!< Position of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Msk (0x1UL << EGU_INTENCLR_TRIGGERED4_Pos) /*!< Bit mask of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED4_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED4_Clear (1UL) /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
#define EGU_INTENCLR_TRIGGERED3_Pos (3UL) /*!< Position of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Msk (0x1UL << EGU_INTENCLR_TRIGGERED3_Pos) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED3_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED3_Clear (1UL) /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
#define EGU_INTENCLR_TRIGGERED2_Pos (2UL) /*!< Position of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Msk (0x1UL << EGU_INTENCLR_TRIGGERED2_Pos) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED2_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED2_Clear (1UL) /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
#define EGU_INTENCLR_TRIGGERED1_Pos (1UL) /*!< Position of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Msk (0x1UL << EGU_INTENCLR_TRIGGERED1_Pos) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED1_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED1_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
#define EGU_INTENCLR_TRIGGERED0_Pos (0UL) /*!< Position of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Msk (0x1UL << EGU_INTENCLR_TRIGGERED0_Pos) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Disabled (0UL) /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED0_Enabled (1UL) /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED0_Clear (1UL) /*!< Disable */


/* Peripheral: FICR */
/* Description: Factory Information Configuration Registers */

/* Register: FICR_CHIPCONF00 */
/* Description: Unspecified */

/* Bits 29..26 : Master bias bandgap trim */
#define FICR_CHIPCONF00_BGREFTRIM_Pos (26UL) /*!< Position of BGREFTRIM field. */
#define FICR_CHIPCONF00_BGREFTRIM_Msk (0xFUL << FICR_CHIPCONF00_BGREFTRIM_Pos) /*!< Bit mask of BGREFTRIM field. */

/* Bits 25..21 : Threshold trim, power on reset */
#define FICR_CHIPCONF00_RSTVTHTRIM_Pos (21UL) /*!< Position of RSTVTHTRIM field. */
#define FICR_CHIPCONF00_RSTVTHTRIM_Msk (0x1FUL << FICR_CHIPCONF00_RSTVTHTRIM_Pos) /*!< Bit mask of RSTVTHTRIM field. */

/* Bits 20..15 : RCOSC coarse calibration input */
#define FICR_CHIPCONF00_RCOSC32KICOARSEIN_Pos (15UL) /*!< Position of RCOSC32KICOARSEIN field. */
#define FICR_CHIPCONF00_RCOSC32KICOARSEIN_Msk (0x3FUL << FICR_CHIPCONF00_RCOSC32KICOARSEIN_Pos) /*!< Bit mask of RCOSC32KICOARSEIN field. */

/* Bits 14..13 : 32kHz RC oscillator calibration length in number of cycles */
#define FICR_CHIPCONF00_RCOSC32KICALLENGTH_Pos (13UL) /*!< Position of RCOSC32KICALLENGTH field. */
#define FICR_CHIPCONF00_RCOSC32KICALLENGTH_Msk (0x3UL << FICR_CHIPCONF00_RCOSC32KICALLENGTH_Pos) /*!< Bit mask of RCOSC32KICALLENGTH field. */
#define FICR_CHIPCONF00_RCOSC32KICALLENGTH_N64 (0UL) /*!< 64 cycles */
#define FICR_CHIPCONF00_RCOSC32KICALLENGTH_N128 (1UL) /*!< 128 cycles */
#define FICR_CHIPCONF00_RCOSC32KICALLENGTH_N256 (2UL) /*!< 256 cycles */
#define FICR_CHIPCONF00_RCOSC32KICALLENGTH_N512 (3UL) /*!< 512 cycles */

/* Bit 12 : Disable synchronizer on calibration clock request from Rc32kiGenerator. */
#define FICR_CHIPCONF00_RC32KICLOCKSYNCDISABLE_Pos (12UL) /*!< Position of RC32KICLOCKSYNCDISABLE field. */
#define FICR_CHIPCONF00_RC32KICLOCKSYNCDISABLE_Msk (0x1UL << FICR_CHIPCONF00_RC32KICLOCKSYNCDISABLE_Pos) /*!< Bit mask of RC32KICLOCKSYNCDISABLE field. */

/* Bit 11 :   */
#define FICR_CHIPCONF00_DISABLEREGULATORCLOCKFORCING_Pos (11UL) /*!< Position of DISABLEREGULATORCLOCKFORCING field. */
#define FICR_CHIPCONF00_DISABLEREGULATORCLOCKFORCING_Msk (0x1UL << FICR_CHIPCONF00_DISABLEREGULATORCLOCKFORCING_Pos) /*!< Bit mask of DISABLEREGULATORCLOCKFORCING field. */

/* Bits 10..6 : HFCLK ring oscillator trim codes. Previous name: HFROSCTRIM. */
#define FICR_CHIPCONF00_PLL_CALIB_ROSC_Pos (6UL) /*!< Position of PLL_CALIB_ROSC field. */
#define FICR_CHIPCONF00_PLL_CALIB_ROSC_Msk (0x1FUL << FICR_CHIPCONF00_PLL_CALIB_ROSC_Pos) /*!< Bit mask of PLL_CALIB_ROSC field. */

/* Bit 5 : Control the output voltage for LVLP */
#define FICR_CHIPCONF00_LVLPULPALWAYSHIGH_Pos (5UL) /*!< Position of LVLPULPALWAYSHIGH field. */
#define FICR_CHIPCONF00_LVLPULPALWAYSHIGH_Msk (0x1UL << FICR_CHIPCONF00_LVLPULPALWAYSHIGH_Pos) /*!< Bit mask of LVLPULPALWAYSHIGH field. */

