adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bits 4..2 : Disable glitch-filter on clock sources powerup and standby lines */
#define FICR_CHIPCONF00_CLOCKREQFILTERDISABLE_Pos (2UL) /*!< Position of CLOCKREQFILTERDISABLE field. */
#define FICR_CHIPCONF00_CLOCKREQFILTERDISABLE_Msk (0x7UL << FICR_CHIPCONF00_CLOCKREQFILTERDISABLE_Pos) /*!< Bit mask of CLOCKREQFILTERDISABLE field. */
#define FICR_CHIPCONF00_CLOCKREQFILTERDISABLE_XOSC32M (0x1UL) /*!< Disable glitch-filter on powerUp- and standby lines to XOSC32M */
#define FICR_CHIPCONF00_CLOCKREQFILTERDISABLE_32ki (0x2UL) /*!< Disable glitch-filter on powerUp line to Rosc/Xosc/Synth used in clock system A (32ki) */
#define FICR_CHIPCONF00_CLOCKREQFILTERDISABLE_64M (0x4UL) /*!< Disable glitch-filter on powerUp line to PLL used in clock system B (64M) */

/* Bit 1 : Enable clock gate in clock purifier. Should always be 1. */
#define FICR_CHIPCONF00_CKPUREEN_Pos (1UL) /*!< Position of CKPUREEN field. */
#define FICR_CHIPCONF00_CKPUREEN_Msk (0x1UL << FICR_CHIPCONF00_CKPUREEN_Pos) /*!< Bit mask of CKPUREEN field. */

/* Bit 0 : Force LVLP ULP regulators to be always on */
#define FICR_CHIPCONF00_LVLPULPALWAYSON_Pos (0UL) /*!< Position of LVLPULPALWAYSON field. */
#define FICR_CHIPCONF00_LVLPULPALWAYSON_Msk (0x1UL << FICR_CHIPCONF00_LVLPULPALWAYSON_Pos) /*!< Bit mask of LVLPULPALWAYSON field. */

/* Register: FICR_CHIPCONF01 */
/* Description: Unspecified */

/* Bits 30..15 : Control the stay-alive time for VDD2 current comparator */
#define FICR_CHIPCONF01_VREGMAINICMPTIMER_Pos (15UL) /*!< Position of VREGMAINICMPTIMER field. */
#define FICR_CHIPCONF01_VREGMAINICMPTIMER_Msk (0xFFFFUL << FICR_CHIPCONF01_VREGMAINICMPTIMER_Pos) /*!< Bit mask of VREGMAINICMPTIMER field. */

/* Bits 14..11 : Control the output voltage for VREGMAIN */
#define FICR_CHIPCONF01_VREGMAINVOLT_Pos (11UL) /*!< Position of VREGMAINVOLT field. */
#define FICR_CHIPCONF01_VREGMAINVOLT_Msk (0xFUL << FICR_CHIPCONF01_VREGMAINVOLT_Pos) /*!< Bit mask of VREGMAINVOLT field. */

/* Bits 10..6 : VREGANA ULP output voltage calibration */
#define FICR_CHIPCONF01_VREGANAULPCAL_Pos (6UL) /*!< Position of VREGANAULPCAL field. */
#define FICR_CHIPCONF01_VREGANAULPCAL_Msk (0x1FUL << FICR_CHIPCONF01_VREGANAULPCAL_Pos) /*!< Bit mask of VREGANAULPCAL field. */
#define FICR_CHIPCONF01_VREGANAULPCAL_DEF (0UL) /*!< Default voltage */
#define FICR_CHIPCONF01_VREGANAULPCAL_MAX (7UL) /*!< Max voltage */
#define FICR_CHIPCONF01_VREGANAULPCAL_MIN (8UL) /*!< Min voltage */

/* Bits 5..4 : Control the output voltage for VREGRADIO (AVDD_1V3) */
#define FICR_CHIPCONF01_VREGANAVOUT_Pos (4UL) /*!< Position of VREGANAVOUT field. */
#define FICR_CHIPCONF01_VREGANAVOUT_Msk (0x3UL << FICR_CHIPCONF01_VREGANAVOUT_Pos) /*!< Bit mask of VREGANAVOUT field. */

/* Bits 3..0 : RST low power voltage reference trim */
#define FICR_CHIPCONF01_VREFULPTRIM_Pos (0UL) /*!< Position of VREFULPTRIM field. */
#define FICR_CHIPCONF01_VREFULPTRIM_Msk (0xFUL << FICR_CHIPCONF01_VREFULPTRIM_Pos) /*!< Bit mask of VREFULPTRIM field. */

/* Register: FICR_CHIPCONF02 */
/* Description: Unspecified */

/* Bits 6..4 : Calibration of current comparator on VREGMAIN */
#define FICR_CHIPCONF02_VREGMAINULPICMPCAL_Pos (4UL) /*!< Position of VREGMAINULPICMPCAL field. */
#define FICR_CHIPCONF02_VREGMAINULPICMPCAL_Msk (0x7UL << FICR_CHIPCONF02_VREGMAINULPICMPCAL_Pos) /*!< Bit mask of VREGMAINULPICMPCAL field. */

/* Bits 3..0 : Calibration of ULP regulator on VREGMAIN */
#define FICR_CHIPCONF02_VREGMAINULPCAL_Pos (0UL) /*!< Position of VREGMAINULPCAL field. */
#define FICR_CHIPCONF02_VREGMAINULPCAL_Msk (0xFUL << FICR_CHIPCONF02_VREGMAINULPCAL_Pos) /*!< Bit mask of VREGMAINULPCAL field. */

/* Register: FICR_CHIPCONF03 */
/* Description: Unspecified */

/* Bits 30..26 : TBD */
#define FICR_CHIPCONF03_VREGANABUCKCALPWM_Pos (26UL) /*!< Position of VREGANABUCKCALPWM field. */
#define FICR_CHIPCONF03_VREGANABUCKCALPWM_Msk (0x1FUL << FICR_CHIPCONF03_VREGANABUCKCALPWM_Pos) /*!< Bit mask of VREGANABUCKCALPWM field. */

/* Bits 25..24 : TBD */
#define FICR_CHIPCONF03_VREGANABUCKCALMAXILIM_Pos (24UL) /*!< Position of VREGANABUCKCALMAXILIM field. */
#define FICR_CHIPCONF03_VREGANABUCKCALMAXILIM_Msk (0x3UL << FICR_CHIPCONF03_VREGANABUCKCALMAXILIM_Pos) /*!< Bit mask of VREGANABUCKCALMAXILIM field. */

/* Bit 23 : Avoid ULP mode for VREGANA */
#define FICR_CHIPCONF03_VREGANAAVOIDULP_Pos (23UL) /*!< Position of VREGANAAVOIDULP field. */
#define FICR_CHIPCONF03_VREGANAAVOIDULP_Msk (0x1UL << FICR_CHIPCONF03_VREGANAAVOIDULP_Pos) /*!< Bit mask of VREGANAAVOIDULP field. */
#define FICR_CHIPCONF03_VREGANAAVOIDULP_Default (0UL) /*!< Use default behavior */
#define FICR_CHIPCONF03_VREGANAAVOIDULP_AvoidUlp (1UL) /*!< Avoid using ULP */

/* Bits 22..16 : Regulator threshold for VREGANA */
#define FICR_CHIPCONF03_VREGANAPWRREGTHRESHOLD_Pos (16UL) /*!< Position of VREGANAPWRREGTHRESHOLD field. */
#define FICR_CHIPCONF03_VREGANAPWRREGTHRESHOLD_Msk (0x7FUL << FICR_CHIPCONF03_VREGANAPWRREGTHRESHOLD_Pos) /*!< Bit mask of VREGANAPWRREGTHRESHOLD field. */

/* Bits 15..0 : Control the stay-alive time for the VREGANA PFM current comparator */
#define FICR_CHIPCONF03_VREGANABUCKPFMICMPTIMER_Pos (0UL) /*!< Position of VREGANABUCKPFMICMPTIMER field. */
#define FICR_CHIPCONF03_VREGANABUCKPFMICMPTIMER_Msk (0xFFFFUL << FICR_CHIPCONF03_VREGANABUCKPFMICMPTIMER_Pos) /*!< Bit mask of VREGANABUCKPFMICMPTIMER field. */

/* Register: FICR_CHIPCONF04 */
/* Description: Unspecified */

/* Bits 7..4 : TBD */
#define FICR_CHIPCONF04_VREGANABUCKCALPFMICMP_Pos (4UL) /*!< Position of VREGANABUCKCALPFMICMP field. */
#define FICR_CHIPCONF04_VREGANABUCKCALPFMICMP_Msk (0xFUL << FICR_CHIPCONF04_VREGANABUCKCALPFMICMP_Pos) /*!< Bit mask of VREGANABUCKCALPFMICMP field. */

/* Bits 3..0 : TBD */
#define FICR_CHIPCONF04_VREGANABUCKCALPFM_Pos (0UL) /*!< Position of VREGANABUCKCALPFM field. */
#define FICR_CHIPCONF04_VREGANABUCKCALPFM_Msk (0xFUL << FICR_CHIPCONF04_VREGANABUCKCALPFM_Pos) /*!< Bit mask of VREGANABUCKCALPFM field. */

/* Register: FICR_SOCINFO_PARTNO */
/* Description: Part number of the device. */

/* Bits 31..0 :   */
#define FICR_SOCINFO_PARTNO_PARTNO_Pos (0UL) /*!< Position of PARTNO field. */
#define FICR_SOCINFO_PARTNO_PARTNO_Msk (0xFFFFFFFFUL << FICR_SOCINFO_PARTNO_PARTNO_Pos) /*!< Bit mask of PARTNO field. */
#define FICR_SOCINFO_PARTNO_PARTNO_nRF5001 (0x14UL) /*!< nRF5001 (Dagger52) */
#define FICR_SOCINFO_PARTNO_PARTNO_nRF5002 (0x15UL) /*!< nRF5002 (Shoto) */
#define FICR_SOCINFO_PARTNO_PARTNO_Unspecified (0xFFFFFFFFUL) /*!< Unspecified */

