adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bits 1..0 : State of the least significant bit in the test word */
#define NVMC_TESTWORDSTATE_STATE_Pos (0UL) /*!< Position of STATE field. */
#define NVMC_TESTWORDSTATE_STATE_Msk (0x3UL << NVMC_TESTWORDSTATE_STATE_Pos) /*!< Bit mask of STATE field. */
#define NVMC_TESTWORDSTATE_STATE_Erased (0UL) /*!< Erased */
#define NVMC_TESTWORDSTATE_STATE_InvPgm (1UL) /*!< Inverse programmed */
#define NVMC_TESTWORDSTATE_STATE_Written0 (2UL) /*!< Written 0 */
#define NVMC_TESTWORDSTATE_STATE_Written1 (3UL) /*!< Written 1 */

/* Register: NVMC_CONFIG */
/* Description: Configuration register */

/* Bits 18..12 : MODE signals of the non-volatile memory macro */
#define NVMC_CONFIG_MODENVM_Pos (12UL) /*!< Position of MODENVM field. */
#define NVMC_CONFIG_MODENVM_Msk (0x7FUL << NVMC_CONFIG_MODENVM_Pos) /*!< Bit mask of MODENVM field. */

/* Bits 9..8 : Page erase configuration */
#define NVMC_CONFIG_ERASEPAGECONFIG_Pos (8UL) /*!< Position of ERASEPAGECONFIG field. */
#define NVMC_CONFIG_ERASEPAGECONFIG_Msk (0x3UL << NVMC_CONFIG_ERASEPAGECONFIG_Pos) /*!< Bit mask of ERASEPAGECONFIG field. */
#define NVMC_CONFIG_ERASEPAGECONFIG_ReProgramErase (0UL) /*!< Erase after re-programming the data read and inverse program */
#define NVMC_CONFIG_ERASEPAGECONFIG_InverseProgramErase (1UL) /*!< Erase after inverse program */
#define NVMC_CONFIG_ERASEPAGECONFIG_Erase (2UL) /*!< Just erase (no re-program and inverse program) */

/* Bit 5 : Handling MODE signals of the non-volatile memory macro */
#define NVMC_CONFIG_MODENVMAUTO_Pos (5UL) /*!< Position of MODENVMAUTO field. */
#define NVMC_CONFIG_MODENVMAUTO_Msk (0x1UL << NVMC_CONFIG_MODENVMAUTO_Pos) /*!< Bit mask of MODENVMAUTO field. */
#define NVMC_CONFIG_MODENVMAUTO_Auto (0UL) /*!< Handled automatically by the non-volatile memory controller */
#define NVMC_CONFIG_MODENVMAUTO_Manual (1UL) /*!< Set by CONFIG.MODENVM register */

/* Bit 4 : Enable external VPP for write and page erase operations */
#define NVMC_CONFIG_EXTERTNALVPP_Pos (4UL) /*!< Position of EXTERTNALVPP field. */
#define NVMC_CONFIG_EXTERTNALVPP_Msk (0x1UL << NVMC_CONFIG_EXTERTNALVPP_Pos) /*!< Bit mask of EXTERTNALVPP field. */
#define NVMC_CONFIG_EXTERTNALVPP_InternalVpp (0UL) /*!< Use internal charge pump */
#define NVMC_CONFIG_EXTERTNALVPP_ExternalVpp (1UL) /*!< Use external VPP */

/* Bits 1..0 : Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. */
#define NVMC_CONFIG_WEN_Pos (0UL) /*!< Position of WEN field. */
#define NVMC_CONFIG_WEN_Msk (0x3UL << NVMC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field. */
#define NVMC_CONFIG_WEN_Ren (0UL) /*!< Read only access */
#define NVMC_CONFIG_WEN_Wen (1UL) /*!< Write enabled */
#define NVMC_CONFIG_WEN_Een (2UL) /*!< Erase enabled */

/* Register: NVMC_ERASEPAGE */
/* Description: Register for erasing a page in code area */

/* Bits 31..0 : Register for starting erase of a page in code area */
#define NVMC_ERASEPAGE_ERASEPAGE_Pos (0UL) /*!< Position of ERASEPAGE field. */
#define NVMC_ERASEPAGE_ERASEPAGE_Msk (0xFFFFFFFFUL << NVMC_ERASEPAGE_ERASEPAGE_Pos) /*!< Bit mask of ERASEPAGE field. */

/* Register: NVMC_ERASEALL */
/* Description: Register for erasing all non-volatile user memory */

/* Bit 0 : Erase all non-volatile memory including UICR registers. The erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased. */
#define NVMC_ERASEALL_ERASEALL_Pos (0UL) /*!< Position of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_Msk (0x1UL << NVMC_ERASEALL_ERASEALL_Pos) /*!< Bit mask of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_NoOperation (0UL) /*!< No operation */
#define NVMC_ERASEALL_ERASEALL_Erase (1UL) /*!< Start chip erase */

/* Register: NVMC_ERASEUICR */
/* Description: Register for erasing whole UICR page */

/* Bit 0 : Erase UICR page. The erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased. */
#define NVMC_ERASEUICR_ERASEUICR_Pos (0UL) /*!< Position of ERASEUICR field. */
#define NVMC_ERASEUICR_ERASEUICR_Msk (0x1UL << NVMC_ERASEUICR_ERASEUICR_Pos) /*!< Bit mask of ERASEUICR field. */
#define NVMC_ERASEUICR_ERASEUICR_NoOperation (0UL) /*!< No operation */
#define NVMC_ERASEUICR_ERASEUICR_Erase (1UL) /*!< Start chip erase */

/* Register: NVMC_WAITSTATENUM */
/* Description: Register to set the number of wait-state for non-volatile memory access. To update the WAITSTATENUM field, the ACCESSCODE must be correct. */

/* Bits 31..16 : Access code for modifying this register */
#define NVMC_WAITSTATENUM_ACCESSCODE_Pos (16UL) /*!< Position of ACCESSCODE field. */
#define NVMC_WAITSTATENUM_ACCESSCODE_Msk (0xFFFFUL << NVMC_WAITSTATENUM_ACCESSCODE_Pos) /*!< Bit mask of ACCESSCODE field. */

/* Bits 7..4 : Wait-states used while cell current test (set by CONFIG.MODENVM register) */
#define NVMC_WAITSTATENUM_WAITSTATENUMICELL_Pos (4UL) /*!< Position of WAITSTATENUMICELL field. */
#define NVMC_WAITSTATENUM_WAITSTATENUMICELL_Msk (0xFUL << NVMC_WAITSTATENUM_WAITSTATENUMICELL_Pos) /*!< Bit mask of WAITSTATENUMICELL field. */

/* Bits 3..0 : Non-volatile memory wait-states */
#define NVMC_WAITSTATENUM_WAITSTATENUM_Pos (0UL) /*!< Position of WAITSTATENUM field. */
#define NVMC_WAITSTATENUM_WAITSTATENUM_Msk (0xFUL << NVMC_WAITSTATENUM_WAITSTATENUM_Pos) /*!< Bit mask of WAITSTATENUM field. */

/* Register: NVMC_TESTWORD */
/* Description: Test the programming state of the least significant bit in a word */

/* Bits 31..0 : Address of the test word */
#define NVMC_TESTWORD_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field. */
#define NVMC_TESTWORD_ADDRESS_Msk (0xFFFFFFFFUL << NVMC_TESTWORD_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Register: NVMC_VSELREAD */
/* Description: Select output voltage of power generator for read mode */

/* Bits 11..8 : Control the VEESEL signal */
#define NVMC_VSELREAD_VEESEL_Pos (8UL) /*!< Position of VEESEL field. */
#define NVMC_VSELREAD_VEESEL_Msk (0xFUL << NVMC_VSELREAD_VEESEL_Pos) /*!< Bit mask of VEESEL field. */

/* Bits 7..4 : Control the VPPSEL signal */
#define NVMC_VSELREAD_VPPSEL_Pos (4UL) /*!< Position of VPPSEL field. */
#define NVMC_VSELREAD_VPPSEL_Msk (0xFUL << NVMC_VSELREAD_VPPSEL_Pos) /*!< Bit mask of VPPSEL field. */

/* Bits 3..0 : Control the VWLSEL signal */
#define NVMC_VSELREAD_VWLSEL_Pos (0UL) /*!< Position of VWLSEL field. */
#define NVMC_VSELREAD_VWLSEL_Msk (0xFUL << NVMC_VSELREAD_VWLSEL_Pos) /*!< Bit mask of VWLSEL field. */

/* Register: NVMC_VSELWRITE */
/* Description: Select output voltage of power generator for write mode */

