adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bits 11..8 : Control the VEESEL signal */
#define NVMC_VSELWRITE_VEESEL_Pos (8UL) /*!< Position of VEESEL field. */
#define NVMC_VSELWRITE_VEESEL_Msk (0xFUL << NVMC_VSELWRITE_VEESEL_Pos) /*!< Bit mask of VEESEL field. */

/* Bits 7..4 : Control the VPPSEL signal */
#define NVMC_VSELWRITE_VPPSEL_Pos (4UL) /*!< Position of VPPSEL field. */
#define NVMC_VSELWRITE_VPPSEL_Msk (0xFUL << NVMC_VSELWRITE_VPPSEL_Pos) /*!< Bit mask of VPPSEL field. */

/* Bits 3..0 : Control the VWLSEL signal */
#define NVMC_VSELWRITE_VWLSEL_Pos (0UL) /*!< Position of VWLSEL field. */
#define NVMC_VSELWRITE_VWLSEL_Msk (0xFUL << NVMC_VSELWRITE_VWLSEL_Pos) /*!< Bit mask of VWLSEL field. */

/* Register: NVMC_VSELERASE */
/* Description: Select output voltage of power generator for erase mode */

/* Bits 11..8 : Control the VEESEL signal */
#define NVMC_VSELERASE_VEESEL_Pos (8UL) /*!< Position of VEESEL field. */
#define NVMC_VSELERASE_VEESEL_Msk (0xFUL << NVMC_VSELERASE_VEESEL_Pos) /*!< Bit mask of VEESEL field. */

/* Bits 7..4 : Control the VPPSEL signal */
#define NVMC_VSELERASE_VPPSEL_Pos (4UL) /*!< Position of VPPSEL field. */
#define NVMC_VSELERASE_VPPSEL_Msk (0xFUL << NVMC_VSELERASE_VPPSEL_Pos) /*!< Bit mask of VPPSEL field. */

/* Bits 3..0 : Control the VWLSEL signal */
#define NVMC_VSELERASE_VWLSEL_Pos (0UL) /*!< Position of VWLSEL field. */
#define NVMC_VSELERASE_VWLSEL_Msk (0xFUL << NVMC_VSELERASE_VWLSEL_Pos) /*!< Bit mask of VWLSEL field. */

/* Register: NVMC_TESTMODE */
/* Description: Register for entering test mode. Refer to the MTP IP test documentation for more details. */

/* Bits 15..0 : Register for entering test mode. Refer to the MTP IP test documentation for more details. This register does not return the same value as written. */
#define NVMC_TESTMODE_TESTMODE_Pos (0UL) /*!< Position of TESTMODE field. */
#define NVMC_TESTMODE_TESTMODE_Msk (0xFFFFUL << NVMC_TESTMODE_TESTMODE_Pos) /*!< Bit mask of TESTMODE field. */
#define NVMC_TESTMODE_TESTMODE_NORMAL (0UL) /*!< Read: Not in test-mode. */
#define NVMC_TESTMODE_TESTMODE_TESTMODE1 (1UL) /*!< Read: In test-mode 1. */
#define NVMC_TESTMODE_TESTMODE_TESTMODE2 (2UL) /*!< Read: In test-mode 2. */
#define NVMC_TESTMODE_TESTMODE_TESTMODE3 (4UL) /*!< Read: In test-mode 3. */
#define NVMC_TESTMODE_TESTMODE_SetNORMAL (0UL) /*!< Write: Sets NORMAL mode. */
#define NVMC_TESTMODE_TESTMODE_SetTESTMODE2 (0xABCDUL) /*!< Write: Sets test-mode 2. */
#define NVMC_TESTMODE_TESTMODE_SetTESTMODE1 (0xBCDEUL) /*!< Write: Sets test-mode 1. */
#define NVMC_TESTMODE_TESTMODE_SetTESTMODE3 (0xCDEFUL) /*!< Write: Sets test-mode 3. */

/* Register: NVMC_TESTMASSERASE */
/* Description: Self-timed mass-erase operation */

/* Bits 1..0 : Self-timed mass-erase operation */
#define NVMC_TESTMASSERASE_TESTMASSERASE_Pos (0UL) /*!< Position of TESTMASSERASE field. */
#define NVMC_TESTMASSERASE_TESTMASSERASE_Msk (0x3UL << NVMC_TESTMASSERASE_TESTMASSERASE_Pos) /*!< Bit mask of TESTMASSERASE field. */
#define NVMC_TESTMASSERASE_TESTMASSERASE_NOOPERATION0 (0UL) /*!< No operation */
#define NVMC_TESTMASSERASE_TESTMASSERASE_NOOPERATION1 (1UL) /*!< No operation */
#define NVMC_TESTMASSERASE_TESTMASSERASE_NOOPERATION2 (2UL) /*!< No operation */
#define NVMC_TESTMASSERASE_TESTMASSERASE_EVERYTHING (3UL) /*!< Erase everything (all information pages and main block) */

/* Register: NVMC_TESTDATA128 */
/* Description: Description collection: Direct MTP test data word n */

/* Bits 31..0 : Returns data out from MTP when reading. Sets MTP data in when writing. */
#define NVMC_TESTDATA128_TESTDATA_Pos (0UL) /*!< Position of TESTDATA field. */
#define NVMC_TESTDATA128_TESTDATA_Msk (0xFFFFFFFFUL << NVMC_TESTDATA128_TESTDATA_Pos) /*!< Bit mask of TESTDATA field. */

/* Register: NVMC_TESTDATA128INC */
/* Description: Description collection: Direct MTP test data word n. Post-increments TESTCONTROLADDR */

/* Bits 31..0 : Returns data out from MTP when reading. Use TESTDATA128[1:0] registers to set the compared data. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access. */
#define NVMC_TESTDATA128INC_TESTDATA_Pos (0UL) /*!< Position of TESTDATA field. */
#define NVMC_TESTDATA128INC_TESTDATA_Msk (0xFFFFFFFFUL << NVMC_TESTDATA128INC_TESTDATA_Pos) /*!< Bit mask of TESTDATA field. */

/* Register: NVMC_TESTCMPINC */
/* Description: Reads and compares last MTP row to TESTDATA128 content. Post-increments TESTCONTROLADDR. */

/* Bit 1 : Reads and compares last MTP row (latched lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access. */
#define NVMC_TESTCMPINC_LATCHED_Pos (1UL) /*!< Position of LATCHED field. */
#define NVMC_TESTCMPINC_LATCHED_Msk (0x1UL << NVMC_TESTCMPINC_LATCHED_Pos) /*!< Bit mask of LATCHED field. */
#define NVMC_TESTCMPINC_LATCHED_Equal (0UL) /*!< Latched TESTDATA128 content and MTP row read are equal */
#define NVMC_TESTCMPINC_LATCHED_NotEqual (1UL) /*!< Latched TESTDATA128 content and MTP row read are different */

/* Bit 0 : Reads and compares last MTP row (direct lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access. */
#define NVMC_TESTCMPINC_DIRECT_Pos (0UL) /*!< Position of DIRECT field. */
#define NVMC_TESTCMPINC_DIRECT_Msk (0x1UL << NVMC_TESTCMPINC_DIRECT_Pos) /*!< Bit mask of DIRECT field. */
#define NVMC_TESTCMPINC_DIRECT_Equal (0UL) /*!< Direct TESTDATA128 content and MTP row read are equal */
#define NVMC_TESTCMPINC_DIRECT_NotEqual (1UL) /*!< Direct TESTDATA128 content and MTP row read are different */

/* Register: NVMC_TESTNCMPINC */
/* Description: Reads and compares last MTP row to complement of TESTDATA128 content. Post-increments TESTCONTROLADDR. */

