adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bit 1 : Reads and compares last MTP row (latched lines) to the complement of TESTDATA128 content (all bits inverted). Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access. */
#define NVMC_TESTNCMPINC_LATCHED_Pos (1UL) /*!< Position of LATCHED field. */
#define NVMC_TESTNCMPINC_LATCHED_Msk (0x1UL << NVMC_TESTNCMPINC_LATCHED_Pos) /*!< Bit mask of LATCHED field. */
#define NVMC_TESTNCMPINC_LATCHED_Complement (0UL) /*!< Latched TESTDATA128 content and MTP row read are each-other's complement */
#define NVMC_TESTNCMPINC_LATCHED_NotComplement (1UL) /*!< Latched TESTDATA128 content and MTP row read are not each-other's complement */

/* Bit 0 : Reads and compares last MTP row (direct lines) to the complement of TESTDATA128 content (all bits inverted). Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access. */
#define NVMC_TESTNCMPINC_DIRECT_Pos (0UL) /*!< Position of DIRECT field. */
#define NVMC_TESTNCMPINC_DIRECT_Msk (0x1UL << NVMC_TESTNCMPINC_DIRECT_Pos) /*!< Bit mask of DIRECT field. */
#define NVMC_TESTNCMPINC_DIRECT_Complement (0UL) /*!< Direct TESTDATA128 content and MTP row read are each-other's complement */
#define NVMC_TESTNCMPINC_DIRECT_NotComplement (1UL) /*!< Direct TESTDATA128 content and MTP row read are not each-other's complement */

/* Register: NVMC_TESTCONTROLLINES */
/* Description: Direct MTP test, control lines. Refer to the MTP IP documentation for more details. */

/* Bit 31 : Control the RSTB signal */
#define NVMC_TESTCONTROLLINES_RSTB_Pos (31UL) /*!< Position of RSTB field. */
#define NVMC_TESTCONTROLLINES_RSTB_Msk (0x1UL << NVMC_TESTCONTROLLINES_RSTB_Pos) /*!< Bit mask of RSTB field. */

/* Bit 30 : Control the CE signal */
#define NVMC_TESTCONTROLLINES_CE_Pos (30UL) /*!< Position of CE field. */
#define NVMC_TESTCONTROLLINES_CE_Msk (0x1UL << NVMC_TESTCONTROLLINES_CE_Pos) /*!< Bit mask of CE field. */

/* Bits 29..23 : Control the MODE signal */
#define NVMC_TESTCONTROLLINES_MODE_Pos (23UL) /*!< Position of MODE field. */
#define NVMC_TESTCONTROLLINES_MODE_Msk (0x7FUL << NVMC_TESTCONTROLLINES_MODE_Pos) /*!< Bit mask of MODE field. */

/* Register: NVMC_TESTCONTROLADDR */
/* Description: Direct MTP test control, address lines */

/* Bits 13..11 : Control the SADDR signal */
#define NVMC_TESTCONTROLADDR_SADDR_Pos (11UL) /*!< Position of SADDR field. */
#define NVMC_TESTCONTROLADDR_SADDR_Msk (0x7UL << NVMC_TESTCONTROLADDR_SADDR_Pos) /*!< Bit mask of SADDR field. */

/* Bits 10..8 : Control the YADDR signal */
#define NVMC_TESTCONTROLADDR_YADDR_Pos (8UL) /*!< Position of YADDR field. */
#define NVMC_TESTCONTROLADDR_YADDR_Msk (0x7UL << NVMC_TESTCONTROLADDR_YADDR_Pos) /*!< Bit mask of YADDR field. */

/* Bits 7..0 : Control the X address signal */
#define NVMC_TESTCONTROLADDR_XADDR_Pos (0UL) /*!< Position of XADDR field. */
#define NVMC_TESTCONTROLADDR_XADDR_Msk (0xFFUL << NVMC_TESTCONTROLADDR_XADDR_Pos) /*!< Bit mask of XADDR field. */

/* Register: NVMC_TESTCOUNTERRELOAD */
/* Description: Counter reload value, used when counting from CE rising edge to latching of data */

/* Bits 11..0 : Counter reload value, in MCU bus cycles, used when counting from CE rising edge to latching of data. Value of 0 has no effect (counter will not latch) */
#define NVMC_TESTCOUNTERRELOAD_RELOAD_Pos (0UL) /*!< Position of RELOAD field. */
#define NVMC_TESTCOUNTERRELOAD_RELOAD_Msk (0xFFFUL << NVMC_TESTCOUNTERRELOAD_RELOAD_Pos) /*!< Bit mask of RELOAD field. */

/* Register: NVMC_TESTCOUNTERRUNNING */
/* Description: Returns the state (counting or not) of the counter */

/* Bit 0 : Returns the state of the counter */
#define NVMC_TESTCOUNTERRUNNING_RUNNING_Pos (0UL) /*!< Position of RUNNING field. */
#define NVMC_TESTCOUNTERRUNNING_RUNNING_Msk (0x1UL << NVMC_TESTCOUNTERRUNNING_RUNNING_Pos) /*!< Bit mask of RUNNING field. */
#define NVMC_TESTCOUNTERRUNNING_RUNNING_NotRunning (0UL) /*!< Counter is not running */
#define NVMC_TESTCOUNTERRUNNING_RUNNING_Running (1UL) /*!< Counter is running */

/* Register: NVMC_TESTCONFIG */
/* Description: Mode of operation of the counter */

/* Bit 3 : Disables the address auto-increment or -decrement */
#define NVMC_TESTCONFIG_AUTOINCEN_Pos (3UL) /*!< Position of AUTOINCEN field. */
#define NVMC_TESTCONFIG_AUTOINCEN_Msk (0x1UL << NVMC_TESTCONFIG_AUTOINCEN_Pos) /*!< Bit mask of AUTOINCEN field. */
#define NVMC_TESTCONFIG_AUTOINCEN_Enable (0UL) /*!< Address auto-incrementing/decrementing is enabled */
#define NVMC_TESTCONFIG_AUTOINCEN_Disable (1UL) /*!< Address auto-incrementing/decrementing is disabled */

/* Bit 2 : Controls the address auto-increment or -decrement */
#define NVMC_TESTCONFIG_AUTOINC_Pos (2UL) /*!< Position of AUTOINC field. */
#define NVMC_TESTCONFIG_AUTOINC_Msk (0x1UL << NVMC_TESTCONFIG_AUTOINC_Pos) /*!< Bit mask of AUTOINC field. */
#define NVMC_TESTCONFIG_AUTOINC_Increment (0UL) /*!< Address is auto-incrementing */
#define NVMC_TESTCONFIG_AUTOINC_Decrement (1UL) /*!< Address is auto-decrementing */

/* Bit 1 : Defines the starting point of the counter */
#define NVMC_TESTCONFIG_START_Pos (1UL) /*!< Position of START field. */
#define NVMC_TESTCONFIG_START_Msk (0x1UL << NVMC_TESTCONFIG_START_Pos) /*!< Bit mask of START field. */
#define NVMC_TESTCONFIG_START_CE (0UL) /*!< Counter starts on CE rising edge */
#define NVMC_TESTCONFIG_START_None (1UL) /*!< None */

/* Bit 0 : Returns the state of the counter */
#define NVMC_TESTCONFIG_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define NVMC_TESTCONFIG_ENABLE_Msk (0x1UL << NVMC_TESTCONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define NVMC_TESTCONFIG_ENABLE_Disabled (0UL) /*!< Counter is disabled */
#define NVMC_TESTCONFIG_ENABLE_Enabled (1UL) /*!< Counter is enabled */

/* Register: NVMC_TESTMEASVPPEN */
/* Description: Controls analog signals for MTP measurements */

/* Bit 1 : Enable the analog test bus (ATB) connecting VEEE and VWLE from MTP. The VPP has dedicated pin called DECP. */
#define NVMC_TESTMEASVPPEN_ATBEN_Pos (1UL) /*!< Position of ATBEN field. */
#define NVMC_TESTMEASVPPEN_ATBEN_Msk (0x1UL << NVMC_TESTMEASVPPEN_ATBEN_Pos) /*!< Bit mask of ATBEN field. */
#define NVMC_TESTMEASVPPEN_ATBEN_Disabled (0UL) /*!< ATB disabled */
#define NVMC_TESTMEASVPPEN_ATBEN_Enabled (1UL) /*!< ATB enabled */

/* Bit 0 : Analog enable for Cell Current Measurement Port. Needs to be set when measuring MEAS on P0.00. */
#define NVMC_TESTMEASVPPEN_MEASEN_Pos (0UL) /*!< Position of MEASEN field. */
#define NVMC_TESTMEASVPPEN_MEASEN_Msk (0x1UL << NVMC_TESTMEASVPPEN_MEASEN_Pos) /*!< Bit mask of MEASEN field. */
#define NVMC_TESTMEASVPPEN_MEASEN_Disabled (0x0UL) /*!< MEAS pad disabled */
#define NVMC_TESTMEASVPPEN_MEASEN_Enabled (0x1UL) /*!< MEAS pad enabled */

/* Register: NVMC_TESTPOWERCONTROL */
/* Description: Direct test, control lines to the MTP power generator module. Refer to the MTP IP documentation for more details. */

/* Bit 31 : Control the RD (read enable) signal */
#define NVMC_TESTPOWERCONTROL_RD_Pos (31UL) /*!< Position of RD field. */
#define NVMC_TESTPOWERCONTROL_RD_Msk (0x1UL << NVMC_TESTPOWERCONTROL_RD_Pos) /*!< Bit mask of RD field. */

/* Bit 30 : Control the PGM (program enable) signal */
#define NVMC_TESTPOWERCONTROL_PGM_Pos (30UL) /*!< Position of PGM field. */
#define NVMC_TESTPOWERCONTROL_PGM_Msk (0x1UL << NVMC_TESTPOWERCONTROL_PGM_Pos) /*!< Bit mask of PGM field. */

/* Bit 29 : Control the ERS (erase enable) signal */
#define NVMC_TESTPOWERCONTROL_ERS_Pos (29UL) /*!< Position of ERS field. */
#define NVMC_TESTPOWERCONTROL_ERS_Msk (0x1UL << NVMC_TESTPOWERCONTROL_ERS_Pos) /*!< Bit mask of ERS field. */

/* Bit 28 : Enable clock from PCGC to the CLK signal */
#define NVMC_TESTPOWERCONTROL_CLKEN_Pos (28UL) /*!< Position of CLKEN field. */
#define NVMC_TESTPOWERCONTROL_CLKEN_Msk (0x1UL << NVMC_TESTPOWERCONTROL_CLKEN_Pos) /*!< Bit mask of CLKEN field. */

/* Bits 27..24 : Control the VMODE signal */
#define NVMC_TESTPOWERCONTROL_VMODE_Pos (24UL) /*!< Position of VMODE field. */
#define NVMC_TESTPOWERCONTROL_VMODE_Msk (0xFUL << NVMC_TESTPOWERCONTROL_VMODE_Pos) /*!< Bit mask of VMODE field. */

/* Bits 23..20 : Control the VWLSEL signal */
#define NVMC_TESTPOWERCONTROL_VWLSEL_Pos (20UL) /*!< Position of VWLSEL field. */
#define NVMC_TESTPOWERCONTROL_VWLSEL_Msk (0xFUL << NVMC_TESTPOWERCONTROL_VWLSEL_Pos) /*!< Bit mask of VWLSEL field. */

/* Bits 19..16 : Control the VPPSEL signal */
#define NVMC_TESTPOWERCONTROL_VPPSEL_Pos (16UL) /*!< Position of VPPSEL field. */
#define NVMC_TESTPOWERCONTROL_VPPSEL_Msk (0xFUL << NVMC_TESTPOWERCONTROL_VPPSEL_Pos) /*!< Bit mask of VPPSEL field. */

