adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bits 15..12 : Control the VEESEL signal */
#define NVMC_TESTPOWERCONTROL_VEESEL_Pos (12UL) /*!< Position of VEESEL field. */
#define NVMC_TESTPOWERCONTROL_VEESEL_Msk (0xFUL << NVMC_TESTPOWERCONTROL_VEESEL_Pos) /*!< Bit mask of VEESEL field. */

/* Register: NVMC_FORCEONNVM */
/* Description: Force on NVM supply */

/* Bit 0 : Force on NVM supply */
#define NVMC_FORCEONNVM_FORCEONNVM_Pos (0UL) /*!< Position of FORCEONNVM field. */
#define NVMC_FORCEONNVM_FORCEONNVM_Msk (0x1UL << NVMC_FORCEONNVM_FORCEONNVM_Pos) /*!< Bit mask of FORCEONNVM field. */
#define NVMC_FORCEONNVM_FORCEONNVM_DoNotForceOn (0UL) /*!< Do not force on NVM supply */
#define NVMC_FORCEONNVM_FORCEONNVM_ForceOn (1UL) /*!< Force on NVM supply */

/* Register: NVMC_FORCEOFFNVM */
/* Description: Force off NVM supply */

/* Bits 31..0 : Force off NVM supply */
#define NVMC_FORCEOFFNVM_FORCEOFFNVM_Pos (0UL) /*!< Position of FORCEOFFNVM field. */
#define NVMC_FORCEOFFNVM_FORCEOFFNVM_Msk (0xFFFFFFFFUL << NVMC_FORCEOFFNVM_FORCEOFFNVM_Pos) /*!< Bit mask of FORCEOFFNVM field. */
#define NVMC_FORCEOFFNVM_FORCEOFFNVM_NotForcedOff (0UL) /*!< Read: NVM supply not forced off */
#define NVMC_FORCEOFFNVM_FORCEOFFNVM_ForcedOff (1UL) /*!< Read: NVM supply force off */
#define NVMC_FORCEOFFNVM_FORCEOFFNVM_DisableForceOff (0UL) /*!< Write: Do not force off NVM supply */
#define NVMC_FORCEOFFNVM_FORCEOFFNVM_EnableForceOff (0xACCE5500UL) /*!< Write: Force off NVM supply */


/* Peripheral: OSCILLATORS */
/* Description: Oscillator control */

/* Register: OSCILLATORS_BYPASSHFXOSC */
/* Description: Enable or disable bypass of HFCLK crystal oscillator with external clock source */

/* Bit 0 : Enable or disable bypass of HFCLK crystal oscillator with external clock source */
#define OSCILLATORS_BYPASSHFXOSC_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_BYPASSHFXOSC_BYPASS_Msk (0x1UL << OSCILLATORS_BYPASSHFXOSC_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_BYPASSHFXOSC_BYPASS_Disabled (0UL) /*!< Disable (use with crystal or low-swing external source) */
#define OSCILLATORS_BYPASSHFXOSC_BYPASS_Enabled (1UL) /*!< Enable (use with rail-to-rail external source) */

/* Register: OSCILLATORS_PLL64M_BYPASS */
/* Description: PLL64M bypass control */

/* Bit 0 : Enable or disable bypass of PLL64M by an external clock source */
#define OSCILLATORS_PLL64M_BYPASS_BYPASS_Pos (0UL) /*!< Position of BYPASS field. */
#define OSCILLATORS_PLL64M_BYPASS_BYPASS_Msk (0x1UL << OSCILLATORS_PLL64M_BYPASS_BYPASS_Pos) /*!< Bit mask of BYPASS field. */
#define OSCILLATORS_PLL64M_BYPASS_BYPASS_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_PLL64M_BYPASS_BYPASS_Enabled (1UL) /*!< Enable */

/* Register: OSCILLATORS_PLL64M_MUTE */
/* Description: Mute the PLL64M */

/* Bit 0 : Mute output clock */
#define OSCILLATORS_PLL64M_MUTE_MUTE_Pos (0UL) /*!< Position of MUTE field. */
#define OSCILLATORS_PLL64M_MUTE_MUTE_Msk (0x1UL << OSCILLATORS_PLL64M_MUTE_MUTE_Pos) /*!< Bit mask of MUTE field. */
#define OSCILLATORS_PLL64M_MUTE_MUTE_Disabled (0UL) /*!< Disable */
#define OSCILLATORS_PLL64M_MUTE_MUTE_Enabled (1UL) /*!< Enable */

/* Register: OSCILLATORS_PLL64M_PROGCHPUMP */
/* Description: Program charge pump current */

/* Bit 0 : Program charge pump current (only used for debugging) */
#define OSCILLATORS_PLL64M_PROGCHPUMP_PROGCHPUMP_Pos (0UL) /*!< Position of PROGCHPUMP field. */
#define OSCILLATORS_PLL64M_PROGCHPUMP_PROGCHPUMP_Msk (0x1UL << OSCILLATORS_PLL64M_PROGCHPUMP_PROGCHPUMP_Pos) /*!< Bit mask of PROGCHPUMP field. */

/* Register: OSCILLATORS_PLL64M_VCOTRIM */
/* Description: VCO trim value for the 64 MHz PLL */

/* Bits 5..0 : VCO trim value for the 64 MHz PLL */
#define OSCILLATORS_PLL64M_VCOTRIM_VCOTRIM_Pos (0UL) /*!< Position of VCOTRIM field. */
#define OSCILLATORS_PLL64M_VCOTRIM_VCOTRIM_Msk (0x3FUL << OSCILLATORS_PLL64M_VCOTRIM_VCOTRIM_Pos) /*!< Bit mask of VCOTRIM field. */

/* Register: OSCILLATORS_PLL64M_VCOTRIMOVERRIDE */
/* Description: Control overriding of the VCO trim values */

/* Bit 0 : VCO trim value for the 64 MHz PLL */
#define OSCILLATORS_PLL64M_VCOTRIMOVERRIDE_VCOTRIMOVERRIDE_Pos (0UL) /*!< Position of VCOTRIMOVERRIDE field. */
#define OSCILLATORS_PLL64M_VCOTRIMOVERRIDE_VCOTRIMOVERRIDE_Msk (0x1UL << OSCILLATORS_PLL64M_VCOTRIMOVERRIDE_VCOTRIMOVERRIDE_Pos) /*!< Bit mask of VCOTRIMOVERRIDE field. */
#define OSCILLATORS_PLL64M_VCOTRIMOVERRIDE_VCOTRIMOVERRIDE_Disabled (0UL) /*!< VCO trim values are coming from FICR */
#define OSCILLATORS_PLL64M_VCOTRIMOVERRIDE_VCOTRIMOVERRIDE_Enabled (1UL) /*!< VCO trim values are coming from the VCOTRIM register */


/* Peripheral: GPIO */
/* Description: GPIO Port 0 */

/* Register: GPIO_OUT */
/* Description: Write GPIO port */

/* Bit 31 : Pin 31 */
#define GPIO_OUT_PIN31_Pos (31UL) /*!< Position of PIN31 field. */
#define GPIO_OUT_PIN31_Msk (0x1UL << GPIO_OUT_PIN31_Pos) /*!< Bit mask of PIN31 field. */
#define GPIO_OUT_PIN31_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN31_High (1UL) /*!< Pin driver is high */

/* Bit 30 : Pin 30 */
#define GPIO_OUT_PIN30_Pos (30UL) /*!< Position of PIN30 field. */
#define GPIO_OUT_PIN30_Msk (0x1UL << GPIO_OUT_PIN30_Pos) /*!< Bit mask of PIN30 field. */
#define GPIO_OUT_PIN30_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN30_High (1UL) /*!< Pin driver is high */

/* Bit 29 : Pin 29 */
#define GPIO_OUT_PIN29_Pos (29UL) /*!< Position of PIN29 field. */
#define GPIO_OUT_PIN29_Msk (0x1UL << GPIO_OUT_PIN29_Pos) /*!< Bit mask of PIN29 field. */
#define GPIO_OUT_PIN29_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN29_High (1UL) /*!< Pin driver is high */

/* Bit 28 : Pin 28 */
#define GPIO_OUT_PIN28_Pos (28UL) /*!< Position of PIN28 field. */
#define GPIO_OUT_PIN28_Msk (0x1UL << GPIO_OUT_PIN28_Pos) /*!< Bit mask of PIN28 field. */
#define GPIO_OUT_PIN28_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN28_High (1UL) /*!< Pin driver is high */

/* Bit 27 : Pin 27 */
#define GPIO_OUT_PIN27_Pos (27UL) /*!< Position of PIN27 field. */
#define GPIO_OUT_PIN27_Msk (0x1UL << GPIO_OUT_PIN27_Pos) /*!< Bit mask of PIN27 field. */
#define GPIO_OUT_PIN27_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN27_High (1UL) /*!< Pin driver is high */

/* Bit 26 : Pin 26 */
#define GPIO_OUT_PIN26_Pos (26UL) /*!< Position of PIN26 field. */
#define GPIO_OUT_PIN26_Msk (0x1UL << GPIO_OUT_PIN26_Pos) /*!< Bit mask of PIN26 field. */
#define GPIO_OUT_PIN26_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN26_High (1UL) /*!< Pin driver is high */

/* Bit 25 : Pin 25 */
#define GPIO_OUT_PIN25_Pos (25UL) /*!< Position of PIN25 field. */
#define GPIO_OUT_PIN25_Msk (0x1UL << GPIO_OUT_PIN25_Pos) /*!< Bit mask of PIN25 field. */
#define GPIO_OUT_PIN25_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN25_High (1UL) /*!< Pin driver is high */

/* Bit 24 : Pin 24 */
#define GPIO_OUT_PIN24_Pos (24UL) /*!< Position of PIN24 field. */
#define GPIO_OUT_PIN24_Msk (0x1UL << GPIO_OUT_PIN24_Pos) /*!< Bit mask of PIN24 field. */
#define GPIO_OUT_PIN24_Low (0UL) /*!< Pin driver is low */
#define GPIO_OUT_PIN24_High (1UL) /*!< Pin driver is high */

