adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bit 0 : Priority register for RAM AHB slave 0 */
#define PAMLI_RAMPRI_RADIO_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define PAMLI_RAMPRI_RADIO_RAM0_Msk (0x1UL << PAMLI_RAMPRI_RADIO_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define PAMLI_RAMPRI_RADIO_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_RADIO_RAM0_Pri1 (1UL) /*!< Priority 1 */

/* Register: PAMLI_RAMPRI_ECB */
/* Description: AHB bus master priority register for ECB */

/* Bit 3 : Priority register for RAM AHB slave 3 */
#define PAMLI_RAMPRI_ECB_RAM3_Pos (3UL) /*!< Position of RAM3 field. */
#define PAMLI_RAMPRI_ECB_RAM3_Msk (0x1UL << PAMLI_RAMPRI_ECB_RAM3_Pos) /*!< Bit mask of RAM3 field. */
#define PAMLI_RAMPRI_ECB_RAM3_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_ECB_RAM3_Pri1 (1UL) /*!< Priority 1 */

/* Bit 2 : Priority register for RAM AHB slave 2 */
#define PAMLI_RAMPRI_ECB_RAM2_Pos (2UL) /*!< Position of RAM2 field. */
#define PAMLI_RAMPRI_ECB_RAM2_Msk (0x1UL << PAMLI_RAMPRI_ECB_RAM2_Pos) /*!< Bit mask of RAM2 field. */
#define PAMLI_RAMPRI_ECB_RAM2_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_ECB_RAM2_Pri1 (1UL) /*!< Priority 1 */

/* Bit 1 : Priority register for RAM AHB slave 1 */
#define PAMLI_RAMPRI_ECB_RAM1_Pos (1UL) /*!< Position of RAM1 field. */
#define PAMLI_RAMPRI_ECB_RAM1_Msk (0x1UL << PAMLI_RAMPRI_ECB_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define PAMLI_RAMPRI_ECB_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_ECB_RAM1_Pri1 (1UL) /*!< Priority 1 */

/* Bit 0 : Priority register for RAM AHB slave 0 */
#define PAMLI_RAMPRI_ECB_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define PAMLI_RAMPRI_ECB_RAM0_Msk (0x1UL << PAMLI_RAMPRI_ECB_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define PAMLI_RAMPRI_ECB_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_ECB_RAM0_Pri1 (1UL) /*!< Priority 1 */

/* Register: PAMLI_RAMPRI_CCM */
/* Description: AHB bus master priority register for CCM */

/* Bit 3 : Priority register for RAM AHB slave 3 */
#define PAMLI_RAMPRI_CCM_RAM3_Pos (3UL) /*!< Position of RAM3 field. */
#define PAMLI_RAMPRI_CCM_RAM3_Msk (0x1UL << PAMLI_RAMPRI_CCM_RAM3_Pos) /*!< Bit mask of RAM3 field. */
#define PAMLI_RAMPRI_CCM_RAM3_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_CCM_RAM3_Pri1 (1UL) /*!< Priority 1 */

/* Bit 2 : Priority register for RAM AHB slave 2 */
#define PAMLI_RAMPRI_CCM_RAM2_Pos (2UL) /*!< Position of RAM2 field. */
#define PAMLI_RAMPRI_CCM_RAM2_Msk (0x1UL << PAMLI_RAMPRI_CCM_RAM2_Pos) /*!< Bit mask of RAM2 field. */
#define PAMLI_RAMPRI_CCM_RAM2_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_CCM_RAM2_Pri1 (1UL) /*!< Priority 1 */

/* Bit 1 : Priority register for RAM AHB slave 1 */
#define PAMLI_RAMPRI_CCM_RAM1_Pos (1UL) /*!< Position of RAM1 field. */
#define PAMLI_RAMPRI_CCM_RAM1_Msk (0x1UL << PAMLI_RAMPRI_CCM_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define PAMLI_RAMPRI_CCM_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_CCM_RAM1_Pri1 (1UL) /*!< Priority 1 */

/* Bit 0 : Priority register for RAM AHB slave 0 */
#define PAMLI_RAMPRI_CCM_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define PAMLI_RAMPRI_CCM_RAM0_Msk (0x1UL << PAMLI_RAMPRI_CCM_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define PAMLI_RAMPRI_CCM_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_CCM_RAM0_Pri1 (1UL) /*!< Priority 1 */

/* Register: PAMLI_RAMPRI_AAR */
/* Description: AHB bus master priority register for AAR */

/* Bit 3 : Priority register for RAM AHB slave 3 */
#define PAMLI_RAMPRI_AAR_RAM3_Pos (3UL) /*!< Position of RAM3 field. */
#define PAMLI_RAMPRI_AAR_RAM3_Msk (0x1UL << PAMLI_RAMPRI_AAR_RAM3_Pos) /*!< Bit mask of RAM3 field. */
#define PAMLI_RAMPRI_AAR_RAM3_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_AAR_RAM3_Pri1 (1UL) /*!< Priority 1 */

/* Bit 2 : Priority register for RAM AHB slave 2 */
#define PAMLI_RAMPRI_AAR_RAM2_Pos (2UL) /*!< Position of RAM2 field. */
#define PAMLI_RAMPRI_AAR_RAM2_Msk (0x1UL << PAMLI_RAMPRI_AAR_RAM2_Pos) /*!< Bit mask of RAM2 field. */
#define PAMLI_RAMPRI_AAR_RAM2_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_AAR_RAM2_Pri1 (1UL) /*!< Priority 1 */

/* Bit 1 : Priority register for RAM AHB slave 1 */
#define PAMLI_RAMPRI_AAR_RAM1_Pos (1UL) /*!< Position of RAM1 field. */
#define PAMLI_RAMPRI_AAR_RAM1_Msk (0x1UL << PAMLI_RAMPRI_AAR_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define PAMLI_RAMPRI_AAR_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_AAR_RAM1_Pri1 (1UL) /*!< Priority 1 */

/* Bit 0 : Priority register for RAM AHB slave 0 */
#define PAMLI_RAMPRI_AAR_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define PAMLI_RAMPRI_AAR_RAM0_Msk (0x1UL << PAMLI_RAMPRI_AAR_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define PAMLI_RAMPRI_AAR_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_AAR_RAM0_Pri1 (1UL) /*!< Priority 1 */

/* Register: PAMLI_RAMPRI_PWM */
/* Description: AHB bus master priority register for PWM0 */

/* Bit 3 : Priority register for RAM AHB slave 3 */
#define PAMLI_RAMPRI_PWM_RAM3_Pos (3UL) /*!< Position of RAM3 field. */
#define PAMLI_RAMPRI_PWM_RAM3_Msk (0x1UL << PAMLI_RAMPRI_PWM_RAM3_Pos) /*!< Bit mask of RAM3 field. */
#define PAMLI_RAMPRI_PWM_RAM3_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_PWM_RAM3_Pri1 (1UL) /*!< Priority 1 */

/* Bit 2 : Priority register for RAM AHB slave 2 */
#define PAMLI_RAMPRI_PWM_RAM2_Pos (2UL) /*!< Position of RAM2 field. */
#define PAMLI_RAMPRI_PWM_RAM2_Msk (0x1UL << PAMLI_RAMPRI_PWM_RAM2_Pos) /*!< Bit mask of RAM2 field. */
#define PAMLI_RAMPRI_PWM_RAM2_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_PWM_RAM2_Pri1 (1UL) /*!< Priority 1 */

/* Bit 1 : Priority register for RAM AHB slave 1 */
#define PAMLI_RAMPRI_PWM_RAM1_Pos (1UL) /*!< Position of RAM1 field. */
#define PAMLI_RAMPRI_PWM_RAM1_Msk (0x1UL << PAMLI_RAMPRI_PWM_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define PAMLI_RAMPRI_PWM_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_PWM_RAM1_Pri1 (1UL) /*!< Priority 1 */

/* Bit 0 : Priority register for RAM AHB slave 0 */
#define PAMLI_RAMPRI_PWM_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define PAMLI_RAMPRI_PWM_RAM0_Msk (0x1UL << PAMLI_RAMPRI_PWM_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define PAMLI_RAMPRI_PWM_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define PAMLI_RAMPRI_PWM_RAM0_Pri1 (1UL) /*!< Priority 1 */


/* Peripheral: PCGCMASTER */
/* Description: PCGC Master */

