adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bits 7..0 : DPPI channel that task DMA_START will subscribe to */
#define RADIO_SUBSCRIBE_DMA_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_DMA_START_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DMA_START_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_DMA_STOP */
/* Description: Subscribe configuration for task DMA_STOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DMA_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_DMA_STOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DMA_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_DMA_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_DMA_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task DMA_STOP will subscribe to */
#define RADIO_SUBSCRIBE_DMA_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_DMA_STOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DMA_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_ACQSTART */
/* Description: Subscribe configuration for task ACQSTART */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_ACQSTART_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_ACQSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_ACQSTART_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_ACQSTART_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_ACQSTART_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task ACQSTART will subscribe to */
#define RADIO_SUBSCRIBE_ACQSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_ACQSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_ACQSTOP */
/* Description: Subscribe configuration for task ACQSTOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_ACQSTOP_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_ACQSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_ACQSTOP_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_ACQSTOP_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_ACQSTOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task ACQSTOP will subscribe to */
#define RADIO_SUBSCRIBE_ACQSTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_ACQSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_ACQSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_PCGC_PCP2_ZERO */
/* Description: Subscribe configuration for task PCGC_PCP2_ZERO */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_PCGC_PCP2_ZERO_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP2_ZERO_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PCGC_PCP2_ZERO_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP2_ZERO_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_PCGC_PCP2_ZERO_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PCGC_PCP2_ZERO will subscribe to */
#define RADIO_SUBSCRIBE_PCGC_PCP2_ZERO_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_PCGC_PCP2_ZERO_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_PCGC_PCP2_ZERO_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_PCGC_PCP2_FULL */
/* Description: Subscribe configuration for task PCGC_PCP2_FULL */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_PCGC_PCP2_FULL_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP2_FULL_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PCGC_PCP2_FULL_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP2_FULL_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_PCGC_PCP2_FULL_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PCGC_PCP2_FULL will subscribe to */
#define RADIO_SUBSCRIBE_PCGC_PCP2_FULL_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_PCGC_PCP2_FULL_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_PCGC_PCP2_FULL_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_PCGC_PCP1_ZERO */
/* Description: Subscribe configuration for task PCGC_PCP1_ZERO */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_PCGC_PCP1_ZERO_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP1_ZERO_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PCGC_PCP1_ZERO_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP1_ZERO_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_PCGC_PCP1_ZERO_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PCGC_PCP1_ZERO will subscribe to */
#define RADIO_SUBSCRIBE_PCGC_PCP1_ZERO_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_PCGC_PCP1_ZERO_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_PCGC_PCP1_ZERO_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_PCGC_PCP1_FULL */
/* Description: Subscribe configuration for task PCGC_PCP1_FULL */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_PCGC_PCP1_FULL_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP1_FULL_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PCGC_PCP1_FULL_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP1_FULL_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_PCGC_PCP1_FULL_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PCGC_PCP1_FULL will subscribe to */
#define RADIO_SUBSCRIBE_PCGC_PCP1_FULL_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_PCGC_PCP1_FULL_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_PCGC_PCP1_FULL_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_PCGC_PCP0_ZERO */
/* Description: Subscribe configuration for task PCGC_PCP0_ZERO */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_PCGC_PCP0_ZERO_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP0_ZERO_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PCGC_PCP0_ZERO_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP0_ZERO_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_PCGC_PCP0_ZERO_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PCGC_PCP0_ZERO will subscribe to */
#define RADIO_SUBSCRIBE_PCGC_PCP0_ZERO_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_PCGC_PCP0_ZERO_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_PCGC_PCP0_ZERO_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_PCGC_PCP0_FULL */
/* Description: Subscribe configuration for task PCGC_PCP0_FULL */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_PCGC_PCP0_FULL_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP0_FULL_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PCGC_PCP0_FULL_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_PCGC_PCP0_FULL_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_PCGC_PCP0_FULL_EN_Enabled (1UL) /*!< Enable subscription */

