adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Register: RADIO_PCGC_FORCEREG */
/* Description: Power and clock */

/* Bit 0 : Power and clock */
#define RADIO_PCGC_FORCEREG_PCGC_FORCEREG_Pos (0UL) /*!< Position of PCGC_FORCEREG field. */
#define RADIO_PCGC_FORCEREG_PCGC_FORCEREG_Msk (0x1UL << RADIO_PCGC_FORCEREG_PCGC_FORCEREG_Pos) /*!< Bit mask of PCGC_FORCEREG field. */

/* Register: RADIO_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define RADIO_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define RADIO_POWER_POWER_Msk (0x1UL << RADIO_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define RADIO_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define RADIO_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: RAMBIST */
/* Description: The RamBist perform hardware accelerated RAM tests */

/* Register: RAMBIST_STATUS_BIST */
/* Description: Status of the BIST */

/* Bit 2 : The RamBist is currently waiting for a RUNBIST handshake, see retention test protocol */
#define RAMBIST_STATUS_BIST_SLEEP_Pos (2UL) /*!< Position of SLEEP field. */
#define RAMBIST_STATUS_BIST_SLEEP_Msk (0x1UL << RAMBIST_STATUS_BIST_SLEEP_Pos) /*!< Bit mask of SLEEP field. */

/* Bit 1 : The RamBist passed, meaning all the compares in the pattern succeded */
#define RAMBIST_STATUS_BIST_PASSED_Pos (1UL) /*!< Position of PASSED field. */
#define RAMBIST_STATUS_BIST_PASSED_Msk (0x1UL << RAMBIST_STATUS_BIST_PASSED_Pos) /*!< Bit mask of PASSED field. */

/* Bit 0 : The RamBist is finished */
#define RAMBIST_STATUS_BIST_DONE_Pos (0UL) /*!< Position of DONE field. */
#define RAMBIST_STATUS_BIST_DONE_Msk (0x1UL << RAMBIST_STATUS_BIST_DONE_Pos) /*!< Bit mask of DONE field. */

/* Register: RAMBIST_STATUS_FAULTY */
/* Description: Which blocks are failing the test */

/* Bits 15..0 : 0 if block has no miscompares, 1 if block has miscompares.
 Size and indices are equal to CLAMP.BLOCKS */
#define RAMBIST_STATUS_FAULTY_BLOCKS_Pos (0UL) /*!< Position of BLOCKS field. */
#define RAMBIST_STATUS_FAULTY_BLOCKS_Msk (0xFFFFUL << RAMBIST_STATUS_FAULTY_BLOCKS_Pos) /*!< Bit mask of BLOCKS field. */

/* Register: RAMBIST_RUN */
/* Description: Run the BIST engine, must be kept 1 until the BIST is finished */

/* Bit 0 : When 1, the RamBist runs */
#define RAMBIST_RUN_BIST_Pos (0UL) /*!< Position of BIST field. */
#define RAMBIST_RUN_BIST_Msk (0x1UL << RAMBIST_RUN_BIST_Pos) /*!< Bit mask of BIST field. */

/* Register: RAMBIST_CONFIG_RAMBIST */
/* Description: Configuration of the RamBist itself. When none of the fields are set, it runs the standard production test BIST. */

/* Bit 1 : Runs the retention test protocol, does only exists if the connected RAMs require retention test */
#define RAMBIST_CONFIG_RAMBIST_RETENTION_Pos (1UL) /*!< Position of RETENTION field. */
#define RAMBIST_CONFIG_RAMBIST_RETENTION_Msk (0x1UL << RAMBIST_CONFIG_RAMBIST_RETENTION_Pos) /*!< Bit mask of RETENTION field. */

/* Bit 0 : Runs a fast subset of the tests, intended for debug only */
#define RAMBIST_CONFIG_RAMBIST_QUICKMODE_Pos (0UL) /*!< Position of QUICKMODE field. */
#define RAMBIST_CONFIG_RAMBIST_QUICKMODE_Msk (0x1UL << RAMBIST_CONFIG_RAMBIST_QUICKMODE_Pos) /*!< Bit mask of QUICKMODE field. */

/* Register: RAMBIST_CONFIG_RAM */
/* Description: Override of the RAM configuration */

/* Bits 6..0 : Depending on the RAM Vendor, this field is different.
 The reset value is also vendor dependent.
(Noted as Vendor[width]: [Signal[width]=..].)
 TSMC0[4:0]: WTSEL[2:0], RTSEL[1:0].
 TSMC1[1:0]: TSEL[1:0].
 MobileSemi[6:0]: BTRIM[3:0], WM, RM, RWM. */
#define RAMBIST_CONFIG_RAM_CONFIG_Pos (0UL) /*!< Position of CONFIG field. */
#define RAMBIST_CONFIG_RAM_CONFIG_Msk (0x7FUL << RAMBIST_CONFIG_RAM_CONFIG_Pos) /*!< Bit mask of CONFIG field. */

/* Register: RAMBIST_CONFIG_CLAMP */
/* Description: Clamp/Exclude certain blocks from the test */

/* Bits 15..0 : Bit indexed, if an entry is 1, the block is not receiving stimuli, and excluded from the comparison. Parameterized with the number of RAM macros */
#define RAMBIST_CONFIG_CLAMP_BLOCKS_Pos (0UL) /*!< Position of BLOCKS field. */
#define RAMBIST_CONFIG_CLAMP_BLOCKS_Msk (0xFFFFUL << RAMBIST_CONFIG_CLAMP_BLOCKS_Pos) /*!< Bit mask of BLOCKS field. */


/* Peripheral: RCOSC32K */
/* Description: 32.768 kHz RC oscillator */

/* Register: RCOSC32K_TASKS_CAL */
/* Description: Start calibration of LFRC oscillator */

/* Bit 0 : Start calibration of LFRC oscillator */
#define RCOSC32K_TASKS_CAL_TASKS_CAL_Pos (0UL) /*!< Position of TASKS_CAL field. */
#define RCOSC32K_TASKS_CAL_TASKS_CAL_Msk (0x1UL << RCOSC32K_TASKS_CAL_TASKS_CAL_Pos) /*!< Bit mask of TASKS_CAL field. */
#define RCOSC32K_TASKS_CAL_TASKS_CAL_Trigger (1UL) /*!< Trigger task */

/* Register: RCOSC32K_TASKS_CTSTART */
/* Description: Deprecated register - Start calibration timer */

/* Bit 0 : Deprecated field -  Start calibration timer */
#define RCOSC32K_TASKS_CTSTART_TASKS_CTSTART_Pos (0UL) /*!< Position of TASKS_CTSTART field. */
#define RCOSC32K_TASKS_CTSTART_TASKS_CTSTART_Msk (0x1UL << RCOSC32K_TASKS_CTSTART_TASKS_CTSTART_Pos) /*!< Bit mask of TASKS_CTSTART field. */
#define RCOSC32K_TASKS_CTSTART_TASKS_CTSTART_Trigger (1UL) /*!< Trigger task */

/* Register: RCOSC32K_TASKS_CTSTOP */
/* Description: Deprecated register - Stop calibration timer */

/* Bit 0 : Deprecated field -  Stop calibration timer */
#define RCOSC32K_TASKS_CTSTOP_TASKS_CTSTOP_Pos (0UL) /*!< Position of TASKS_CTSTOP field. */
#define RCOSC32K_TASKS_CTSTOP_TASKS_CTSTOP_Msk (0x1UL << RCOSC32K_TASKS_CTSTOP_TASKS_CTSTOP_Pos) /*!< Bit mask of TASKS_CTSTOP field. */
#define RCOSC32K_TASKS_CTSTOP_TASKS_CTSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RCOSC32K_SUBSCRIBE_CAL */
/* Description: Subscribe configuration for task CAL */

/* Bit 31 :   */
#define RCOSC32K_SUBSCRIBE_CAL_EN_Pos (31UL) /*!< Position of EN field. */
#define RCOSC32K_SUBSCRIBE_CAL_EN_Msk (0x1UL << RCOSC32K_SUBSCRIBE_CAL_EN_Pos) /*!< Bit mask of EN field. */
#define RCOSC32K_SUBSCRIBE_CAL_EN_Disabled (0UL) /*!< Disable subscription */
#define RCOSC32K_SUBSCRIBE_CAL_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CAL will subscribe to */
#define RCOSC32K_SUBSCRIBE_CAL_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RCOSC32K_SUBSCRIBE_CAL_CHIDX_Msk (0xFFUL << RCOSC32K_SUBSCRIBE_CAL_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

