adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bit 0 : Enable or disable HPBOR */
#define REGULATORS_DISABLEHPBOR_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_DISABLEHPBOR_DISABLE_Msk (0x1UL << REGULATORS_DISABLEHPBOR_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_DISABLEHPBOR_DISABLE_Enabled (0UL) /*!< Enable HPBOR */
#define REGULATORS_DISABLEHPBOR_DISABLE_Disabled (1UL) /*!< Disable HPBOR */

/* Register: REGULATORS_SYSTEMOFF */
/* Description: System OFF register */

/* Bit 0 : Enable System OFF mode */
#define REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos (0UL) /*!< Position of SYSTEMOFF field. */
#define REGULATORS_SYSTEMOFF_SYSTEMOFF_Msk (0x1UL << REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos) /*!< Bit mask of SYSTEMOFF field. */
#define REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter (1UL) /*!< Enable System OFF mode */

/* Register: REGULATORS_POFCON */
/* Description: Power-fail comparator configuration */

/* Bit 6 : Bypass power-fail comparator hysteresis */
#define REGULATORS_POFCON_HYSTDIS_Pos (6UL) /*!< Position of HYSTDIS field. */
#define REGULATORS_POFCON_HYSTDIS_Msk (0x1UL << REGULATORS_POFCON_HYSTDIS_Pos) /*!< Bit mask of HYSTDIS field. */
#define REGULATORS_POFCON_HYSTDIS_Normal (0UL) /*!< Hysteresis active */
#define REGULATORS_POFCON_HYSTDIS_NoHyst (1UL) /*!< Hysteresis disabled */

/* Bits 4..1 : Power-fail comparator threshold setting */
#define REGULATORS_POFCON_THRESHOLD_Pos (1UL) /*!< Position of THRESHOLD field. */
#define REGULATORS_POFCON_THRESHOLD_Msk (0xFUL << REGULATORS_POFCON_THRESHOLD_Pos) /*!< Bit mask of THRESHOLD field. */
#define REGULATORS_POFCON_THRESHOLD_V17 (4UL) /*!< Set threshold to 1.7 V */
#define REGULATORS_POFCON_THRESHOLD_V18 (5UL) /*!< Set threshold to 1.8 V */
#define REGULATORS_POFCON_THRESHOLD_V19 (6UL) /*!< Set threshold to 1.9 V */
#define REGULATORS_POFCON_THRESHOLD_V20 (7UL) /*!< Set threshold to 2.0 V */
#define REGULATORS_POFCON_THRESHOLD_V21 (8UL) /*!< Set threshold to 2.1 V */
#define REGULATORS_POFCON_THRESHOLD_V22 (9UL) /*!< Set threshold to 2.2 V */
#define REGULATORS_POFCON_THRESHOLD_V23 (10UL) /*!< Set threshold to 2.3 V */
#define REGULATORS_POFCON_THRESHOLD_V24 (11UL) /*!< Set threshold to 2.4 V */
#define REGULATORS_POFCON_THRESHOLD_V25 (12UL) /*!< Set threshold to 2.5 V */
#define REGULATORS_POFCON_THRESHOLD_V26 (13UL) /*!< Set threshold to 2.6 V */
#define REGULATORS_POFCON_THRESHOLD_V27 (14UL) /*!< Set threshold to 2.7 V */
#define REGULATORS_POFCON_THRESHOLD_V28 (15UL) /*!< Set threshold to 2.8 V */

/* Bit 0 : Enable or disable power-fail comparator */
#define REGULATORS_POFCON_POF_Pos (0UL) /*!< Position of POF field. */
#define REGULATORS_POFCON_POF_Msk (0x1UL << REGULATORS_POFCON_POF_Pos) /*!< Bit mask of POF field. */
#define REGULATORS_POFCON_POF_Disabled (0UL) /*!< Disable */
#define REGULATORS_POFCON_POF_Enabled (1UL) /*!< Enable */

/* Register: REGULATORS_IGNOREDAPCPWRREGMODE */
/* Description: Ignore DAPCP power mode */

/* Bit 0 : Ignore power request from debugger */
#define REGULATORS_IGNOREDAPCPWRREGMODE_IGNOREDAPCPWRREGMODE_Pos (0UL) /*!< Position of IGNOREDAPCPWRREGMODE field. */
#define REGULATORS_IGNOREDAPCPWRREGMODE_IGNOREDAPCPWRREGMODE_Msk (0x1UL << REGULATORS_IGNOREDAPCPWRREGMODE_IGNOREDAPCPWRREGMODE_Pos) /*!< Bit mask of IGNOREDAPCPWRREGMODE field. */
#define REGULATORS_IGNOREDAPCPWRREGMODE_IGNOREDAPCPWRREGMODE_DoNotIgnore (0UL) /*!< Do not ignore power request from debugger */
#define REGULATORS_IGNOREDAPCPWRREGMODE_IGNOREDAPCPWRREGMODE_Ignore (1UL) /*!< Ignore power request from debugger */

/* Register: REGULATORS_RSTVTHTRIM */
/* Description: Threshold trim, power-on reset */

/* Bits 4..0 : Threshold trim, power-on reset */
#define REGULATORS_RSTVTHTRIM_RSTVTHTRIM_Pos (0UL) /*!< Position of RSTVTHTRIM field. */
#define REGULATORS_RSTVTHTRIM_RSTVTHTRIM_Msk (0x1FUL << REGULATORS_RSTVTHTRIM_RSTVTHTRIM_Pos) /*!< Bit mask of RSTVTHTRIM field. */

/* Register: REGULATORS_BGREFTRIM */
/* Description: Master bias bandgap trim */

/* Bits 3..0 : Threshold trim, brown-out reset for VDDL battery */
#define REGULATORS_BGREFTRIM_BGREFTRIM_Pos (0UL) /*!< Position of BGREFTRIM field. */
#define REGULATORS_BGREFTRIM_BGREFTRIM_Msk (0xFUL << REGULATORS_BGREFTRIM_BGREFTRIM_Pos) /*!< Bit mask of BGREFTRIM field. */

/* Register: REGULATORS_VREFULPTRIM */
/* Description: Trim value of VREF_ULP */

/* Bits 3..0 : Trim value of VREF_ULP Default 4'b0011 */
#define REGULATORS_VREFULPTRIM_VREFULPTRIM_Pos (0UL) /*!< Position of VREFULPTRIM field. */
#define REGULATORS_VREFULPTRIM_VREFULPTRIM_Msk (0xFUL << REGULATORS_VREFULPTRIM_VREFULPTRIM_Pos) /*!< Bit mask of VREFULPTRIM field. */

/* Register: REGULATORS_FORCEVBUSDET */
/* Description: Force VBUS detection indication */

/* Bits 1..0 : Force VBUS detection indication, overriding the analog detection circuitry */
#define REGULATORS_FORCEVBUSDET_FORCEVBUSDET_Pos (0UL) /*!< Position of FORCEVBUSDET field. */
#define REGULATORS_FORCEVBUSDET_FORCEVBUSDET_Msk (0x3UL << REGULATORS_FORCEVBUSDET_FORCEVBUSDET_Pos) /*!< Bit mask of FORCEVBUSDET field. */
#define REGULATORS_FORCEVBUSDET_FORCEVBUSDET_DoNotForce (0UL) /*!< Do not force VBUS detection output */
#define REGULATORS_FORCEVBUSDET_FORCEVBUSDET_ForceNoVbusDet (1UL) /*!< Force detection output to 'no VBUS present' */
#define REGULATORS_FORCEVBUSDET_FORCEVBUSDET_DoNotForce2 (2UL) /*!< Do not force VBUS detection output (same effect as DoNotForce) */
#define REGULATORS_FORCEVBUSDET_FORCEVBUSDET_ForceVbusDet (3UL) /*!< Force detection output to 'VBUS present' */

/* Register: REGULATORS_VREGANA_VOUT */
/* Description: Control the output voltage */

/* Bits 1..0 : Output voltage */
#define REGULATORS_VREGANA_VOUT_VOUT_Pos (0UL) /*!< Position of VOUT field. */
#define REGULATORS_VREGANA_VOUT_VOUT_Msk (0x3UL << REGULATORS_VREGANA_VOUT_VOUT_Pos) /*!< Bit mask of VOUT field. */
#define REGULATORS_VREGANA_VOUT_VOUT_00 (0UL) /*!< 1.0 V */
#define REGULATORS_VREGANA_VOUT_VOUT_01 (1UL) /*!< 1.05 V */
#define REGULATORS_VREGANA_VOUT_VOUT_10 (2UL) /*!< 1.10 V */
#define REGULATORS_VREGANA_VOUT_VOUT_11 (3UL) /*!< 1.20 V */

/* Register: REGULATORS_VREGANA_DCDCEN */
/* Description: Enable DC/DC operation of the regulator */

/* Bit 0 : Enable or disable DC/DC converter */
#define REGULATORS_VREGANA_DCDCEN_DCDCEN_Pos (0UL) /*!< Position of DCDCEN field. */
#define REGULATORS_VREGANA_DCDCEN_DCDCEN_Msk (0x1UL << REGULATORS_VREGANA_DCDCEN_DCDCEN_Pos) /*!< Bit mask of DCDCEN field. */
#define REGULATORS_VREGANA_DCDCEN_DCDCEN_Disabled (0UL) /*!< Disable */
#define REGULATORS_VREGANA_DCDCEN_DCDCEN_Enabled (1UL) /*!< Enable */

