adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Register: REGULATORS_VREGANA_ENFORCEPWRREGMODE */
/* Description: Enable forcing of power mode in power regulator */

/* Bit 0 : Enable forcing of power mode in power regulator */
#define REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos (0UL) /*!< Position of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Msk (0x1UL << REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos) /*!< Bit mask of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Disabled (0UL) /*!< Power regulator forcing off */
#define REGULATORS_VREGANA_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Enabled (1UL) /*!< Power regulator mode forced to value given by FORCEREGMODE */

/* Register: REGULATORS_VREGANA_FORCEREGMODE */
/* Description: Backdoor register for manual selection of power mode */

/* Bits 2..0 : Force regulator mode to value */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_Pos (0UL) /*!< Position of FORCEREGMODE field. */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_Msk (0x7UL << REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_Pos) /*!< Bit mask of FORCEREGMODE field. */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_Ext (0UL) /*!< Force external */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_ULP (1UL) /*!< Force ULP mode */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_LDO (2UL) /*!< Force LDO mode */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_DCDC (3UL) /*!< Force DC/DC mode */
#define REGULATORS_VREGANA_FORCEREGMODE_FORCEREGMODE_REF (4UL) /*!< Force REF mode */

/* Register: REGULATORS_VREGANA_CURRENTPWRREGMODE */
/* Description: Current mode in the power regulator */

/* Bits 3..0 : Current mode in the power regulator */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos (0UL) /*!< Position of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Msk (0xFUL << REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos) /*!< Bit mask of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Ext (0UL) /*!< External */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_DCDC (2UL) /*!< DC/DC */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_REF (3UL) /*!< REF */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO (4UL) /*!< ULP DC/DC */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO_DCDC (6UL) /*!< LDO DC/DC */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO_REF (7UL) /*!< LDO REF */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_ULP (8UL) /*!< ULP */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_DCDC_ULP (10UL) /*!< ULP DC/DC */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_REF_ULP (11UL) /*!< REF ULP */
#define REGULATORS_VREGANA_CURRENTPWRREGMODE_CURRENTPWRREGMODE_ULP_LDO (12UL) /*!< ULP DC/DC */

/* Register: REGULATORS_VREGANA_TESTLOAD */
/* Description: Test load setting */

/* Bits 2..0 : Output load configuration (for test purposes) */
#define REGULATORS_VREGANA_TESTLOAD_TESTLOAD_Pos (0UL) /*!< Position of TESTLOAD field. */
#define REGULATORS_VREGANA_TESTLOAD_TESTLOAD_Msk (0x7UL << REGULATORS_VREGANA_TESTLOAD_TESTLOAD_Pos) /*!< Bit mask of TESTLOAD field. */
#define REGULATORS_VREGANA_TESTLOAD_TESTLOAD_NormalOperation (0UL) /*!< Normal operation (default) */
#define REGULATORS_VREGANA_TESTLOAD_TESTLOAD_1mATestLoad (1UL) /*!< 1 mA test load */
#define REGULATORS_VREGANA_TESTLOAD_TESTLOAD_20mATestLoad (2UL) /*!< 20 mA test load */

/* Register: REGULATORS_VREGANA_ULPCAL */
/* Description: Calibration of ULP regulator */

/* Bits 3..0 : Calibration value */
#define REGULATORS_VREGANA_ULPCAL_CAL_Pos (0UL) /*!< Position of CAL field. */
#define REGULATORS_VREGANA_ULPCAL_CAL_Msk (0xFUL << REGULATORS_VREGANA_ULPCAL_CAL_Pos) /*!< Bit mask of CAL field. */

/* Register: REGULATORS_VREGANA_DEBUGLVLP */
/* Description: Debug register - control spare signals in LVLP */

/* Bits 13..0 : Connected to TBD */
#define REGULATORS_VREGANA_DEBUGLVLP_DEBUGLVLP_Pos (0UL) /*!< Position of DEBUGLVLP field. */
#define REGULATORS_VREGANA_DEBUGLVLP_DEBUGLVLP_Msk (0x3FFFUL << REGULATORS_VREGANA_DEBUGLVLP_DEBUGLVLP_Pos) /*!< Bit mask of DEBUGLVLP field. */

/* Register: REGULATORS_VREGANA_BUCKCALMAXILIM */
/* Description: TBD */

/* Bits 1..0 : TBD */
#define REGULATORS_VREGANA_BUCKCALMAXILIM_CALMAXILIM_Pos (0UL) /*!< Position of CALMAXILIM field. */
#define REGULATORS_VREGANA_BUCKCALMAXILIM_CALMAXILIM_Msk (0x3UL << REGULATORS_VREGANA_BUCKCALMAXILIM_CALMAXILIM_Pos) /*!< Bit mask of CALMAXILIM field. */

/* Register: REGULATORS_VREGANA_BUCKCALPWM */
/* Description: TBD */

/* Bits 4..0 : TBD */
#define REGULATORS_VREGANA_BUCKCALPWM_CALPWM_Pos (0UL) /*!< Position of CALPWM field. */
#define REGULATORS_VREGANA_BUCKCALPWM_CALPWM_Msk (0x1FUL << REGULATORS_VREGANA_BUCKCALPWM_CALPWM_Pos) /*!< Bit mask of CALPWM field. */

/* Register: REGULATORS_VREGANA_BUCKPFMEN */
/* Description: PFM enable register */

/* Bit 0 : Enable or disable PFM */
#define REGULATORS_VREGANA_BUCKPFMEN_PFMEN_Pos (0UL) /*!< Position of PFMEN field. */
#define REGULATORS_VREGANA_BUCKPFMEN_PFMEN_Msk (0x1UL << REGULATORS_VREGANA_BUCKPFMEN_PFMEN_Pos) /*!< Bit mask of PFMEN field. */
#define REGULATORS_VREGANA_BUCKPFMEN_PFMEN_Disabled (0UL) /*!< Disable PFM */
#define REGULATORS_VREGANA_BUCKPFMEN_PFMEN_Enabled (1UL) /*!< Enable PFM (default) */

/* Register: REGULATORS_VREGANA_BUCKPFMCAL */
/* Description: TBD */

/* Bits 3..0 : TBD */
#define REGULATORS_VREGANA_BUCKPFMCAL_PFMCAL_Pos (0UL) /*!< Position of PFMCAL field. */
#define REGULATORS_VREGANA_BUCKPFMCAL_PFMCAL_Msk (0xFUL << REGULATORS_VREGANA_BUCKPFMCAL_PFMCAL_Pos) /*!< Bit mask of PFMCAL field. */

/* Register: REGULATORS_VREGANA_BUCKPFMICMPCAL */
/* Description: TBD */

/* Bits 2..0 : TBD */
#define REGULATORS_VREGANA_BUCKPFMICMPCAL_PFMICMPCAL_Pos (0UL) /*!< Position of PFMICMPCAL field. */
#define REGULATORS_VREGANA_BUCKPFMICMPCAL_PFMICMPCAL_Msk (0x7UL << REGULATORS_VREGANA_BUCKPFMICMPCAL_PFMICMPCAL_Pos) /*!< Bit mask of PFMICMPCAL field. */

/* Register: REGULATORS_VREGANA_BUCKPFMICMPCOUNT */
/* Description: TBD */

/* Bits 15..0 : TBD */
#define REGULATORS_VREGANA_BUCKPFMICMPCOUNT_PFMICMPCOUNT_Pos (0UL) /*!< Position of PFMICMPCOUNT field. */
#define REGULATORS_VREGANA_BUCKPFMICMPCOUNT_PFMICMPCOUNT_Msk (0xFFFFUL << REGULATORS_VREGANA_BUCKPFMICMPCOUNT_PFMICMPCOUNT_Pos) /*!< Bit mask of PFMICMPCOUNT field. */

/* Register: REGULATORS_VREGANA_PWRREGTHRESHOLD */
/* Description: Set threshold value of power regulator */

/* Bits 6..0 : Sets the threshold value of power regulator */
#define REGULATORS_VREGANA_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Pos (0UL) /*!< Position of PWRREGTHRESHOLD field. */
#define REGULATORS_VREGANA_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Msk (0x7FUL << REGULATORS_VREGANA_PWRREGTHRESHOLD_PWRREGTHRESHOLD_Pos) /*!< Bit mask of PWRREGTHRESHOLD field. */

/* Register: REGULATORS_VREGANA_AVOIDULP */
/* Description: Backdoor to avoid ULP mode */

