adamkondraciuk/hal_nordic/nrfx/mdk/nrf5002_bitfields.h
/* Bit 0 : Backdoor to avoid ULP mode */
#define REGULATORS_VREGANA_AVOIDULP_ENABLE_Pos (0UL) /*!< Position of ENABLE field. */
#define REGULATORS_VREGANA_AVOIDULP_ENABLE_Msk (0x1UL << REGULATORS_VREGANA_AVOIDULP_ENABLE_Pos) /*!< Bit mask of ENABLE field. */
#define REGULATORS_VREGANA_AVOIDULP_ENABLE_Default (0UL) /*!< FSM will enter ULP mode if no power requests are present. */
#define REGULATORS_VREGANA_AVOIDULP_ENABLE_AvoidUlp (1UL) /*!< Avoids ULP mode. By also setting disableDcdcDvdd=0 and disablePfmDvdd=0, PFM mode will be used as the lowest power regulator state. */

/* Register: REGULATORS_VREGMAIN_VOUT */
/* Description: Control the output voltage */

/* Bits 3..0 : Output voltage */
#define REGULATORS_VREGMAIN_VOUT_VOUT_Pos (0UL) /*!< Position of VOUT field. */
#define REGULATORS_VREGMAIN_VOUT_VOUT_Msk (0xFUL << REGULATORS_VREGMAIN_VOUT_VOUT_Pos) /*!< Bit mask of VOUT field. */

/* Register: REGULATORS_VREGMAIN_ULPALWAYSON */
/* Description: Keep ULP regulator on at all times */

/* Bit 0 : ULP always on */
#define REGULATORS_VREGMAIN_ULPALWAYSON_ULPALWAYSON_Pos (0UL) /*!< Position of ULPALWAYSON field. */
#define REGULATORS_VREGMAIN_ULPALWAYSON_ULPALWAYSON_Msk (0x1UL << REGULATORS_VREGMAIN_ULPALWAYSON_ULPALWAYSON_Pos) /*!< Bit mask of ULPALWAYSON field. */
#define REGULATORS_VREGMAIN_ULPALWAYSON_ULPALWAYSON_Disabled (0UL) /*!< ULP regulator turned off in LDO modes */
#define REGULATORS_VREGMAIN_ULPALWAYSON_ULPALWAYSON_Enabled (1UL) /*!< ULP regulator always on */

/* Register: REGULATORS_VREGMAIN_ENFORCEPWRREGMODE */
/* Description: Enable forcing of power mode in power regulator */

/* Bit 0 : Enable forcing of power mode in power regulator */
#define REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos (0UL) /*!< Position of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Msk (0x1UL << REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Pos) /*!< Bit mask of ENFORCEPWRREGMODE field. */
#define REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Disabled (0UL) /*!< Power regulator forcing off */
#define REGULATORS_VREGMAIN_ENFORCEPWRREGMODE_ENFORCEPWRREGMODE_Enabled (1UL) /*!< Power regulator mode forced to value given by FORCEREGMODE */

/* Register: REGULATORS_VREGMAIN_FORCEREGMODE */
/* Description: Backdoor register for manual selection of power mode */

/* Bits 2..0 : Force regulator mode to value */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_Pos (0UL) /*!< Position of FORCEREGMODE field. */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_Msk (0x7UL << REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_Pos) /*!< Bit mask of FORCEREGMODE field. */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_Ext (0UL) /*!< Force external */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_ULP (1UL) /*!< Force ULP mode */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_LDO (2UL) /*!< Force LDO mode */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_DCDC (3UL) /*!< Force DC/DC mode */
#define REGULATORS_VREGMAIN_FORCEREGMODE_FORCEREGMODE_REF (4UL) /*!< Force REF mode */

/* Register: REGULATORS_VREGMAIN_CURRENTPWRREGMODE */
/* Description: Current mode in the power regulator */

/* Bits 3..0 : Current mode in the power regulator */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos (0UL) /*!< Position of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Msk (0xFUL << REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Pos) /*!< Bit mask of CURRENTPWRREGMODE field. */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_Ext (0UL) /*!< External */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_DCDC (2UL) /*!< DC/DC */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_REF (3UL) /*!< REF */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO (4UL) /*!< ULP DC/DC */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO_DCDC (6UL) /*!< LDO DC/DC */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_LDO_REF (7UL) /*!< LDO REF */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_ULP (8UL) /*!< ULP */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_DCDC_ULP (10UL) /*!< ULP DC/DC */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_REF_ULP (11UL) /*!< REF ULP */
#define REGULATORS_VREGMAIN_CURRENTPWRREGMODE_CURRENTPWRREGMODE_ULP_LDO (12UL) /*!< ULP DC/DC */

/* Register: REGULATORS_VREGMAIN_PWRREGICMPTIMER */
/* Description: Control the stay-alive time for the current comparator */

/* Bits 15..0 :   */
#define REGULATORS_VREGMAIN_PWRREGICMPTIMER_COUNT_Pos (0UL) /*!< Position of COUNT field. */
#define REGULATORS_VREGMAIN_PWRREGICMPTIMER_COUNT_Msk (0xFFFFUL << REGULATORS_VREGMAIN_PWRREGICMPTIMER_COUNT_Pos) /*!< Bit mask of COUNT field. */

/* Register: REGULATORS_VREGMAIN_TESTLOAD */
/* Description: Test load setting */

/* Bits 2..0 : Output load configuration for test purposes */
#define REGULATORS_VREGMAIN_TESTLOAD_TESTLOAD_Pos (0UL) /*!< Position of TESTLOAD field. */
#define REGULATORS_VREGMAIN_TESTLOAD_TESTLOAD_Msk (0x7UL << REGULATORS_VREGMAIN_TESTLOAD_TESTLOAD_Pos) /*!< Bit mask of TESTLOAD field. */
#define REGULATORS_VREGMAIN_TESTLOAD_TESTLOAD_NormalOperation (0UL) /*!< Normal operation (default) */
#define REGULATORS_VREGMAIN_TESTLOAD_TESTLOAD_1mATestLoad (1UL) /*!< 1 mA test load */
#define REGULATORS_VREGMAIN_TESTLOAD_TESTLOAD_20mATestLoad (2UL) /*!< 20 mA test load */

/* Register: REGULATORS_VREGMAIN_ULPCAL */
/* Description: Calibration of ULP regulator */

/* Bits 3..0 : Calibration value */
#define REGULATORS_VREGMAIN_ULPCAL_CAL_Pos (0UL) /*!< Position of CAL field. */
#define REGULATORS_VREGMAIN_ULPCAL_CAL_Msk (0xFUL << REGULATORS_VREGMAIN_ULPCAL_CAL_Pos) /*!< Bit mask of CAL field. */

/* Register: REGULATORS_VREGMAIN_ULPICMPCAL */
/* Description: Calibration of current comparator on ULP regulator */

/* Bits 2..0 :   */
#define REGULATORS_VREGMAIN_ULPICMPCAL_CAL_Pos (0UL) /*!< Position of CAL field. */
#define REGULATORS_VREGMAIN_ULPICMPCAL_CAL_Msk (0x7UL << REGULATORS_VREGMAIN_ULPICMPCAL_CAL_Pos) /*!< Bit mask of CAL field. */

/* Register: REGULATORS_VREGMAIN_BYPASS */
/* Description: Bypass control */

/* Bit 0 : Bypass control */
#define REGULATORS_VREGMAIN_BYPASS_CAL_Pos (0UL) /*!< Position of CAL field. */
#define REGULATORS_VREGMAIN_BYPASS_CAL_Msk (0x1UL << REGULATORS_VREGMAIN_BYPASS_CAL_Pos) /*!< Bit mask of CAL field. */
#define REGULATORS_VREGMAIN_BYPASS_CAL_NormalMode (0UL) /*!< Normal operation (default) */
#define REGULATORS_VREGMAIN_BYPASS_CAL_BypassMode (1UL) /*!< Output voltage is 30 mV lower than input voltage */

/* Register: REGULATORS_DISABLEPACSYSTEMOFFACK */
/* Description: Enable or disable System OFF ack from PAC */

/* Bit 0 : Enable or disable System OFF ack from PAC */
#define REGULATORS_DISABLEPACSYSTEMOFFACK_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_DISABLEPACSYSTEMOFFACK_DISABLE_Msk (0x1UL << REGULATORS_DISABLEPACSYSTEMOFFACK_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_DISABLEPACSYSTEMOFFACK_DISABLE_Enabled (0UL) /*!< Enable ack */
#define REGULATORS_DISABLEPACSYSTEMOFFACK_DISABLE_Disabled (1UL) /*!< Disable ack */

/* Register: REGULATORS_DISABLESRAMSYSTEMOFFACK */
/* Description: Enable or disable System OFF ack from SRAM */

/* Bit 0 : Enable or disable System OFF ack from SRAM */
#define REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Msk (0x1UL << REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Enabled (0UL) /*!< Enable ack */
#define REGULATORS_DISABLESRAMSYSTEMOFFACK_DISABLE_Disabled (1UL) /*!< Disable ack */

/* Register: REGULATORS_DISABLENVMSYSTEMOFFACK */
/* Description: Enable or disable System OFF ack from NVM */

/* Bit 0 : Enable or disable System OFF ack from NVM */
#define REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Pos (0UL) /*!< Position of DISABLE field. */
#define REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Msk (0x1UL << REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Pos) /*!< Bit mask of DISABLE field. */
#define REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Enabled (0UL) /*!< Enable ack */
#define REGULATORS_DISABLENVMSYSTEMOFFACK_DISABLE_Disabled (1UL) /*!< Disable ack */


/* Peripheral: RESET */
/* Description: Reset control */

/* Register: RESET_RESETREAS */
/* Description: Reset reason */

/* Bit 7 : Reset due to wakeup from System OFF mode when wakeup is triggered by entering the debug interface mode */
#define RESET_RESETREAS_DIF_Pos (7UL) /*!< Position of DIF field. */
#define RESET_RESETREAS_DIF_Msk (0x1UL << RESET_RESETREAS_DIF_Pos) /*!< Bit mask of DIF field. */
#define RESET_RESETREAS_DIF_NotDetected (0UL) /*!< Not detected */
#define RESET_RESETREAS_DIF_Detected (1UL) /*!< Detected */

/* Bit 6 : Reset due to wakeup from System OFF mode when wakeup is triggered by ANADETECT signal from LPCOMP */
#define RESET_RESETREAS_LPCOMP_Pos (6UL) /*!< Position of LPCOMP field. */
#define RESET_RESETREAS_LPCOMP_Msk (0x1UL << RESET_RESETREAS_LPCOMP_Pos) /*!< Bit mask of LPCOMP field. */
#define RESET_RESETREAS_LPCOMP_NotDetected (0UL) /*!< Not detected */
#define RESET_RESETREAS_LPCOMP_Detected (1UL) /*!< Detected */

/* Bit 5 : Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO */
#define RESET_RESETREAS_OFF_Pos (5UL) /*!< Position of OFF field. */
#define RESET_RESETREAS_OFF_Msk (0x1UL << RESET_RESETREAS_OFF_Pos) /*!< Bit mask of OFF field. */
#define RESET_RESETREAS_OFF_NotDetected (0UL) /*!< Not detected */
#define RESET_RESETREAS_OFF_Detected (1UL) /*!< Detected */

